{
  "PostValue": {
    "post_id": "7ng6GfR9vtsyc7rgr",
    "value_ea": 5,
    "value_humanity": 2,
    "explanation": "Useful, practical heads-up for EA orgs about a rare, very large ($100M) grant competition. If an EA-aligned organization prepares and wins, the grant could meaningfully scale impact, so the post is moderately valuable for strategic planning and fundraising. It is not foundational theory or broadly decisive for EA strategy, and applies only to large organizations and infrequent cycles. For general humanity the post is low-impact: it’s an informational opportunity that could indirectly benefit many people if the prize funds a successful project, but the post itself does not change outcomes for most people."
  },
  "PostRobustness": {
    "post_id": "7ng6GfR9vtsyc7rgr",
    "robustness_score": 5,
    "actionable_feedback": "1) Avoid speculative timeline claims and add simple next-action links: You state the competition will probably recur in ~3–4 years based on prior rounds. That’s plausible but speculative and could mislead readers into complacency. Either drop the prediction or explicitly label it as a guess, and add concrete next steps (e.g., link to the MacArthur mailing list or contact page so organizations can sign up for alerts). This keeps the post useful without making an uncertain forecast.\\n\\n2) Don’t assume only large orgs can compete — give concrete guidance for smaller EA groups: The post says “only existing (and likely relatively large) organizations would be meaningful contenders,” which risks discouraging smaller groups but may be false (finalists have been coalitions or projects that scaled). Instead, note how smaller orgs could be competitive (partnering with larger orgs, forming coalitions, presenting a clear scale-up plan, or proposing joint applications), and suggest specific preparatory actions (build pilot evidence, develop robust scaling/partnership plans, model a $100M budget). That makes the post actionable for a wider range of EA readers.\\n\\n3) Flag rubric-fit issues for typical EA causes (and suggest checking fit): The scoring rubric emphasizes near‑term measurable impact, evidence of prior effectiveness, and equity/inclusion. That makes some EA priorities (e.g., longtermist/AI-risk research) a poor fit unless framed concretely with measurable short‑term outcomes and equity considerations. Recommend that readers explicitly assess rubric fit before investing effort and suggest including examples of proposal types that align (and types that likely don’t), or at least warn that mission/issue fit matters as much as budget size.",
    "improvement_potential": "Useful, practical feedback that would meaningfully improve the post (remove a speculative claim, add a signup/contact link, and broaden the audience by showing how smaller orgs could compete). These aren’t fatal mistakes but are plausible 'own-goal' items (an unjustified recurrence claim and an unnecessarily discouraging claim about organisation size). Implementing the suggestions would make the post more accurate and actionable without greatly lengthening it."
  },
  "PostAuthorAura": {
    "post_id": "7ng6GfR9vtsyc7rgr",
    "author_fame_ea": 1,
    "author_fame_humanity": 3,
    "explanation": "‘Jack Kelly’ is a very common name and there is no well-known author by that name within the EA/rationalist community. There are several people named Jack Kelly in journalism, entertainment, and niche online spaces, but no single Jack Kelly is a prominent EA/rationalist figure or a globally famous public intellectual. Likely unknown in EA circles and only a minor/sectoral online presence globally; could also be a pseudonym or one of several individuals with that name."
  },
  "PostClarity": {
    "post_id": "7ng6GfR9vtsyc7rgr",
    "clarity_score": 8,
    "explanation": "Overall very clear and well‑structured: the post states the opportunity, key eligibility (≥$100M budget), deadline status, provides links, past finalists and the scoring rubric. Strengths: readable organization, useful links, actionable takeaway (bookmark for future rounds). Weaknesses: minor typos/capitalization (e.g. “a organization”, “MacArthur foundation”), a bit verbose in places (repeating scale/eligibility), and one speculative sentence about timing that could be labeled explicitly as speculation. Tightening phrasing and adding a short explicit call-to-action (who should bookmark/next steps) would make it exceptional."
  },
  "PostNovelty": {
    "post_id": "7ng6GfR9vtsyc7rgr",
    "novelty_ea": 2,
    "novelty_humanity": 3,
    "explanation": "This is primarily an informational post sharing an existing grant opportunity (MacArthur's 100&Change) and its rubric. For EA readers, the content is unlikely to be new — big philanthropic competitions are well-known and many EA orgs track such grants — so novelty is very low. For the general public it's slightly more novel (many people won't know this specific $100M competition), but the post offers no original ideas or analysis beyond flagging the opportunity and suggesting EA orgs consider applying, so overall novelty remains low."
  },
  "PostInferentialSupport": {
    "post_id": "7ng6GfR9vtsyc7rgr",
    "reasoning_quality": 6,
    "evidence_quality": 5,
    "overall_support": 5,
    "explanation": "Strengths: The post is clear, logically organized, and accurately cites the grant, application link, past rounds, examples of finalists, and the scoring rubric—supporting the practical advice to bookmark and prepare for future cycles. The inference that only large organizations will be viable contenders (given the $100M minimum) and that the contest is likely to recur (based on past rounds) is reasonable. Weaknesses: The claim that \"some EA orgs would be meaningful contenders\" is speculative and unsupported by concrete evidence or examples of EA organizations that meet the rubric or scale; no data on EA org budgets, track records, or fit with MacArthur priorities is provided. Overall: useful and credible as a heads-up/resource post, but limited in empirical backing for the more forward-looking or evaluative claims."
  },
  "PostExternalValidation": {
    "post_id": "7ng6GfR9vtsyc7rgr",
    "emperical_claim_validation_score": 9,
    "validation_notes": "The post’s core empirical claims are well-supported by primary sources. MacArthur’s 100&Change is a real competition awarding a single $100 million grant (2017, 2021, and the 3rd round launched in 2024); the application materials explicitly require a budget that \"must be a minimum of $100 million to be considered,\" and the 2024 cycle timeline shows registration was due by August 15, 2024 (applications due Sept 5, 2024). The examples of prior finalists and the five scoring criteria (Impactful, Evidence‑Based, Feasible, Durable, Just) match the official site. The only unverified/subjective claim is the author’s prediction that the competition will recur in ~3–4 years; that is speculative (reasonable given past intervals but not stated by MacArthur).",
    "sources": [
      "100&Change — Application page (requirements and explicit budget language): 100andchange.org/application (MacArthur/Lever for Change).",
      "100&Change — Timeline and registration/application deadlines: 100andchange.org/timeline (shows registration deadline Aug 15, 2024 and application due Sept 5, 2024).",
      "100&Change — Press release launching Round Three (May 22, 2024): 100andchange.org/news/press-release (MacArthur Foundation).",
      "100&Change — 100&Change in Action / Past awardees & finalists (lists 2017 and 2021 winners and 2021 finalists cited in the post): 100andchange.org/100-change-in-action.",
      "100&Change — Scoring Rubric and criteria (Impactful, Evidence‑Based, Feasible, Durable, Just): 100andchange.org/scoring.",
      "FAQ & About pages for 100&Change (additional confirmation of program design and past rounds): 100andchange.org/faq and 100andchange.org/about.",
      "AP News coverage of the 2024 competition launch (summary of criteria and deadlines): AP News, \"$100 million for equity: MacArthur Foundation's new big bet and mandate\" (May 2024).",
      "Barron's coverage of the 2024 competition (context and timeline): Barron's, \"MacArthur Foundation Launches Grant Competition for Nonprofits. The Prize Is $100 Million.\" (May 2024).",
      "100&Change press release announcing five finalists (Apr 30, 2025) confirming selection process and finalists timeline: 100andchange.org/news/macarthur-foundation-announces-five-finalists-for-100-million-competition."
    ]
  }
}