{
  "PostValue": {
    "post_id": "87KxjDiwfrJ3KnjpN",
    "value_ea": 6,
    "value_humanity": 3,
    "explanation": "This post is a useful, actionable roundup of grassroots protest activity around AI that matters for strategy, forecasting, and coalition-building among policy advocates, journalists, and organizers — so it has moderate importance for the EA/AI governance community (not foundational, but helpful for political planning and anticipating flashpoints). For general humanity it’s of minor importance: informative local/global reporting but not decisive for large-scale outcomes (it documents social dynamics rather than proving a high‑stakes causal claim about AGI or global welfare)."
  },
  "PostRobustness": {
    "post_id": "87KxjDiwfrJ3KnjpN",
    "robustness_score": 3,
    "actionable_feedback": "1) Remove or justify the 33% “flashpoint” probability. That precise number is a strong, attention-grabbing claim but you give no methodology or evidence. Either (a) remove the numeric probability and say you think the chance is materially nontrivial, or (b) add a short parenthetical explaining how you arrived at 33% (data, analogies, expert elicitations). Leaving it as-is undermines credibility. \n\n2) Clarify and enforce inclusion criteria / label events more clearly. Right now the roundup mixes AI‑centric protests (voice actors vs. generative audio) with broadly anti‑corporate, anti‑war, or climate actions that only tangentially involve AI (e.g., Palantir/Israel/Trump protests). That risks misleading readers about who is actually mobilizing around AI risks. Fix by adding a one‑line tag for each item (e.g., “AI‑central,” “AI‑adjacent,” “Not primarily about AI but involves AI companies”) and a brief citation or quote from organizers tying the protest to AI where possible. Also add a 1–2 sentence “methodology” note saying how you find/list events and what counts for inclusion. \n\n3) Reconsider granular meetup/contact details and operational security. Publishing weekly bar meeting locations and a personal Signal handle may look like organizing/endorsement and could expose participants to doxxing or harassment. At minimum: make clear you are not an organizer, remove or anonymize private contact details (use a throwaway forum account or anonymous email), and add an explicit safety disclaimer for listed events. If your intent is to be a neutral tracker, prefer public event pages/ticket links over private meetups.",
    "improvement_potential": "The three points are highly relevant and would materially improve credibility, clarity, and safety without greatly lengthening the post. (1) The 33% flashpoint probability is a standout unsupported quantitative claim that undermines trust; removing it or adding justification is important. (2) Clearer inclusion criteria and per-item tags would prevent readers from conflating loosely related protests with genuinely AI‑driven mobilization and improve the post's usefulness for researchers and policymakers. (3) The operational‑security note is salient: publishing private contact handles and small meetup details can look like organizing and risks doxxing — a brief safety disclaimer, anonymizing personal contact, and preferring public event links would fix this. These are critical improvements but not existential errors, so the feedback merits a high score (not maximum) because the issues are serious but fixable."
  },
  "PostAuthorAura": {
    "post_id": "87KxjDiwfrJ3KnjpN",
    "author_fame_ea": 1,
    "author_fame_humanity": 1,
    "explanation": "I am not aware of a notable EA/rationalist author named Rachel Shu up to my 2024-06 knowledge cutoff. There are no well-known publications, talks, or repeated contributions under that name in major EA/rationalist venues, nor wider public recognition. She may be a private author, a pseudonym, or active under a different name — if you share links or context I can reassess."
  },
  "PostClarity": {
    "post_id": "87KxjDiwfrJ3KnjpN",
    "clarity_score": 8,
    "explanation": "Generally clear and well‑structured: tidy headings, consistent event entries with dates/locations, source links, and a stated scope/audience make it easy to follow. The purpose and format (monthly roundup of mass AI protest actions) are explicit. Weaknesses: a few awkward phrasings (e.g. “faster when start to things pick up”), an unsupported numeric claim (33% flashpoint) that feels speculative, and uneven depth/detail across entries. The intro is slightly wordy and could be tightened, but overall the post communicates its point effectively."
  },
  "PostNovelty": {
    "post_id": "87KxjDiwfrJ3KnjpN",
    "novelty_ea": 3,
    "novelty_humanity": 2,
    "explanation": "This is primarily a timely aggregation / roundup of publicly reported protests and meetings rather than a presentation of new theory or claims. For EA Forum readers, the most original elements are the explicit forecasting/framing (e.g. a ~33% chance of a near-term protest ‘flashpoint’ and the focus on how mass advocacy could shape outcomes), but those ideas are extensions of widely discussed themes in longtermist and tech-policy circles. For the general public, the piece is mostly standard news synthesis — useful and well-curated but not conceptually novel."
  },
  "PostInferentialSupport": {
    "post_id": "87KxjDiwfrJ3KnjpN",
    "reasoning_quality": 5,
    "evidence_quality": 6,
    "overall_support": 5,
    "explanation": "Strengths: The post is well structured as a roundup and provides timely, relevant, and mostly credible journalistic and primary-source citations for each reported demonstration, which supports the descriptive claim that a range of protests against AI are occurring globally. Weaknesses: The stronger, predictive claims (e.g., that public opposition is \"inevitable\" to grow quickly and the 33% chance of a major flashpoint in two years) are speculative and not supported by systematic data, models, or citations. The evidence is anecdotal and episodic rather than quantitative (no trend analysis, polling, participant counts, or longitudinal metrics), and there is potential selection bias in which protests are reported. Overall, the post is a solid descriptive resource but offers weak empirical support for its broader forecasts and causal claims."
  },
  "PostExternalValidation": {
    "post_id": "87KxjDiwfrJ3KnjpN",
    "emperical_claim_validation_score": 8,
    "validation_notes": "Most of the post’s empirical claims about specific protests, dates, organizers, and high-level policy outcomes are well-supported by contemporaneous reporting and primary sources. I was able to verify the Pittsburgh (CMU) protests (July 15), multi-city Palantir “Purge Palantir” actions (July 14–15) and June 26 NYC arrests, the Mexico City voice-actor demonstration (July 13–14), the Geneva AI for Good protest (July 8), the Sunrise Movement action at Sam Altman’s home (July 7), PauseAI’s London protest of Google DeepMind (June 30), the Annecy animation-union protest (June 12), and the No Azure for Apartheid actions at Microsoft (multiple dates). The post’s summary of the Senate removing an AI moratorium from the reconciliation bill (99–1 vote) is corroborated by major outlets and official statements. Weaknesses: a few organizer-specific claims (exact organizing-meeting tweets/status IDs and the author’s probabilistic forecast of a “33%” flashpoint are opinion/speculation rather than empirical fact) and some event listings rely on social posts or group pages rather than independent coverage — those are still corroborated by event pages or local reporting in most cases. Overall: the factual reporting of recent demonstrations is largely accurate and verifiable.",
    "sources": [
      "PublicSource: \"Is Pennsylvania a keystone in the AI economy?\" (report on CMU Energy & Innovation Summit protests), July 15, 2025. ([publicsource.org](https://www.publicsource.org/trump-mccormick-visit-cmu-energy-innovation-summit-pittsburgh/?utm_source=chatgpt.com))",
      "Pittsburgh City Paper / Pittsburgh Media Partnership reporting on July 15, 2025 CMU summit protests. ([pghmediapartnership.org](https://pghmediapartnership.org/2025/07/16/pittsburghers-push-back-on-inaugural-pennsylvania-energy-and-innovation-summit-at-cmu/?utm_source=chatgpt.com))",
      "Democracy Now!: \"‘Purge Palantir’: Day of Action Protests Firm’s Role…\" (coverage of multi-city Palantir protests, July 15, 2025). ([democracynow.org](https://www.democracynow.org/2025/7/15/doge_20?utm_source=chatgpt.com))",
      "The Guardian: \"Six arrested at protest of Palantir…\" (June 26, 2025 arrests at Palantir NYC). ([theguardian.com](https://www.theguardian.com/us-news/2025/jun/26/trump-palantir-protest-arrests?utm_source=chatgpt.com))",
      "AFP / Economic Times coverage of Mexico City voice‑actor protests calling for regulation on AI voice cloning (July 14, 2025). ([m.economictimes.com](https://m.economictimes.com/tech/artificial-intelligence/mexican-voice-actors-demand-regulation-on-ai-voice-cloning/amp_articleshow/122433540.cms?utm_source=chatgpt.com), [economictimes.indiatimes.com](https://economictimes.indiatimes.com/tech/artificial-intelligence/mexican-voice-actors-demand-regulation-on-ai-voice-cloning/articleshow/122433540.cms?utm_source=chatgpt.com))",
      "Anadolu Agency: \"Protest in Geneva slams AI for Good Summit…\" (coverage of BDS protest at AI for Good, July 8, 2025). ([aa.com.tr](https://www.aa.com.tr/en/europe/protest-in-geneva-slams-ai-for-good-summit-over-big-techs-reported-role-in-gaza-war/3625487?utm_source=chatgpt.com))",
      "ABC7 / SFGate / SFist reporting on protesters outside OpenAI CEO Sam Altman’s home (Sunrise Movement action, July 7, 2025). ([sfist.com](https://sfist.com/2025/07/07/day-around-the-bay-protesters-gather-outside-sam-altmans-house/?utm_source=chatgpt.com), [sfgate.com](https://www.sfgate.com/news/bayarea/article/we-will-be-back-outside-purported-home-of-19577976.php?utm_source=chatgpt.com))",
      "Business Insider: \"Protesters accuse Google of breaking its promises on AI safety\" (PauseAI protest at DeepMind, June 30, 2025). ([businessinsider.com](https://www.businessinsider.com/protesters-accuse-google-deepmind-breaking-promises-ai-safety-2025-6?utm_source=chatgpt.com))",
      "Animation Magazine / Deadline reporting on Annecy protests by animation unions (June 12, 2025). ([animationmagazine.net](https://www.animationmagazine.net/2025/06/protests-against-artificial-intelligence-use-in-the-industry-planned-for-annecy-animation-fest/?utm_source=chatgpt.com), [instituteofinterneteconomics.org](https://instituteofinterneteconomics.org/annecy-ai-protest-animation-guilds-1236431752/?utm_source=chatgpt.com))",
      "Associated Press / The Verge / GeekWire coverage of No Azure for Apartheid actions and Microsoft responses (May–July 2025). ([apnews.com](https://apnews.com/article/8820200cec5996987d49fbb669322b22?utm_source=chatgpt.com), [theverge.com](https://www.theverge.com/news/766324/microsoft-building-34-lockdown-protesters-brad-smith-office?utm_source=chatgpt.com), [geekwire.com](https://www.geekwire.com/2025/protesters-set-up-temporary-encampment-at-microsoft-hq-to-pressure-company-on-israel-contracts/?utm_source=chatgpt.com))",
      "Wired / Axios / official contract records: reporting on Palantir’s ICE contract (ImmigrationOS) and longstanding ICE work (2025 coverage). ([wired.com](https://www.wired.com/story/ice-palantir-immigrationos?utm_source=chatgpt.com), [axios.com](https://www.axios.com/local/denver/2025/05/01/palantir-deportations-ice-immigration-trump?utm_source=chatgpt.com))",
      "ITU / AI for Good official site and Bulletin of the Atomic Scientists coverage (context on AI for Good summit and related controversy), July 2025. ([aiforgood.itu.int](https://aiforgood.itu.int/summit26/?utm_source=chatgpt.com), [thebulletin.org](https://thebulletin.org/2025/07/ai-for-good-with-caveats-how-a-keynote-speaker-was-censored-during-an-international-artificial-intelligence-summit/?utm_source=chatgpt.com))",
      "Multiple major outlets (AP, The Verge, Washington Post, Senate Commerce press release) documenting the Senate’s 99–1 vote to strip the state-AI moratorium from the reconciliation bill (July 2025). ([apnews.com](https://apnews.com/article/20beeeb6967057be5fe64678f72f6ab0?utm_source=chatgpt.com), [theverge.com](https://www.theverge.com/politics/695495/senate-drops-ai-moratorium-budget-bill?utm_source=chatgpt.com), [commerce.senate.gov](https://www.commerce.senate.gov/2025/7/senate-strikes-ai-moratorium-from-budget-reconciliation-bill-in-overwhelming-99-1-vote/8415a728-fd1d-4269-98ac-101d1d0c71e0?utm_source=chatgpt.com), [washingtonpost.com](https://www.washingtonpost.com/technology/2025/07/01/ai-moratorium-defeat-senate-silicon-valley/?utm_source=chatgpt.com))",
      "Stop AI event pages and StopAI_Info social profile / lu.ma event listings showing local Stop AI meetings and protests in SF/Berkeley (event pages / group profile). ([lu.ma](https://lu.ma/stopai_info?utm_source=chatgpt.com), [sotwe.com](https://www.sotwe.com/StopAI_Info?utm_source=chatgpt.com))"
    ]
  }
}