{
  "PostValue": {
    "post_id": "AeqNocbAiCiKofT5w",
    "value_ea": 5,
    "value_humanity": 3,
    "explanation": "Useful, pragmatic essay offering a clear, context-sensitive framework for whether advocacy groups should be single-issue or multi-issue. For the EA/rationalist community it's moderately important: it can influence organisational design, coalition-building, reputational risk management, and funding choices for EA-aligned campaigns (especially smaller cause areas like animal advocacy), but it isn't foundational to core EA worldviews or existential-risk priorities. For general humanity it's of minor importance: it may modestly affect how NGOs operate and which causes gain salience, but it is not transformative at the societal or policy level. The piece is mainly a thoughtful, experience-based heuristic rather than a definitive empirical claim, so its practical impact depends on context and follow-up evidence or experimentation."
  },
  "PostRobustness": {
    "post_id": "AeqNocbAiCiKofT5w",
    "robustness_score": 3,
    "actionable_feedback": "1) Oversimplified, static model of supporters and missing empirical evidence. The K/L two‑axis model treats supporter preferences as fixed points and ignores key dynamics (media framing, elite cues, co‑option, recruitment vs retention, signaling decay, and how polarization shifts over time). This leads to weak claims like “multi‑issue will attract B and single‑issue A” without evidence. Actionable fixes: (a) either tone down claims to explicitly present the model as illustrative and limited, (b) add at least 2–3 empirical examples or citations where single‑issue vs multi‑issue positioning produced measurable differences, or (c) include a short section on dynamic effects (how positions, salience, and signaling change over time and through events) and how that could flip A vs B in practice.\n\n2) Recommending permanent initial positioning without a governance/decision framework. The post says organizations should choose from the start and ‘rarely change’ but provides no practical decision rules for when to deviate, how to secure legitimacy for expansion, or how to respond under coercion. That’s a major omission because the tension between principled consistency and tactical flexibility is the core operational problem. Actionable fixes: add a concise, operational decision framework (e.g., thresholds for speaking: minimum expected counterfactual impact, coalition/expert vet requirement, democratic sign‑off percent of donors/supporters, legal risk check) and a fallback process (review cadence, public justification template, opt‑out/recusal rules for leaders). Even a short decision tree or 5 checklist items would materially improve the post.\n\n3) Insufficient attention to reputational spillovers, resource constraints, and counterfactual quantification. The post asserts counterfactual impact is the objective but never gives a way to weigh the harms of getting an external issue wrong (reputational damage, donor loss, legal/political risk) against the benefits of signaling on L. Nor does it consider staff bandwidth and message discipline costs of being multi‑issue. Actionable fixes: introduce a simple rubric to evaluate a potential external statement (expected benefit × probability of unique impact) minus expected reputational/operational cost (probability of major blowback × magnitude), mention staffing/capacity as an explicit constraint, and add examples of plausible magnitudes or heuristics (e.g., \"speak only if expected benefit > 2x expected reputational cost\" or \"only comment when supported by independent subject‑matter experts\").\n\nAddressing these three weaknesses (acknowledging model limits and adding evidence, supplying concrete governance rules, and giving a practical cost–benefit rubric) would make the essay far more useful and publishable for EA readers who need operational guidance rather than abstract intuition.",
    "improvement_potential": "The feedback targets three substantive, high-impact weaknesses: an oversimplified static model, a blind recommendation to choose permanence without governance, and missing concrete cost–benefit/reputational accounting. Each point is actionable and would materially improve the post’s usefulness to practitioners without necessarily bloating it (e.g., add a short caveat on model limits, a compact decision checklist, and a simple rubric). These are critical omissions for an operational audience—fixing them would significantly raise the post’s credibility and practical value, though they don’t overturn the essay’s core intuitions."
  },
  "PostAuthorAura": {
    "post_id": "AeqNocbAiCiKofT5w",
    "author_fame_ea": 1,
    "author_fame_humanity": 2,
    "explanation": "I do not recognize 'emre kaplan🔸' as a notable author or handle within the EA/rationalist community — no prominent EA forum posts, publications, talks, or leadership roles for that name/handle appear in my training data (through mid‑2024). There are people named Emre Kaplan in other domains (e.g., regional athletes or academics) with limited public profiles, but none who are widely known globally. If you mean a specific user account or a different spelling, please share a link or more context and I can reassess."
  },
  "PostClarity": {
    "post_id": "AeqNocbAiCiKofT5w",
    "clarity_score": 8,
    "explanation": "Well-structured and easy to follow: the post opens with a clear thesis, lists high-level tendencies, presents a simple model, and then lays out pros and cons with concrete examples and rules of thumb. It communicates its trade-offs and recommendations clearly. Weaknesses: it's somewhat long and occasionally anecdotal or digressive (Turkey example, personal regrets), some claims aren't fully supported or could be tightened, and the diagrams are referenced rather than fully described in text — so a reader needs moderate effort to absorb every nuance."
  },
  "PostNovelty": {
    "post_id": "AeqNocbAiCiKofT5w",
    "novelty_ea": 4,
    "novelty_humanity": 3,
    "explanation": "Most of the post is a clear, well-argued synthesis of familiar trade-offs from advocacy, branding, and coalition politics (expertise/legitimacy, signaling, polarization, coalition composition). Those points are likely already familiar to experienced EA readers. The somewhat more original pieces are the concrete 2‑axis model of supporter distribution framed as areas A/B, the explicit low‑trust / threshold model applied to single‑issue viability (with the Turkey example), and the normative suggestion that small movements should favor multi‑issue norms and that organisations should decide positioning from the start. These melange and contextual emphases are useful but not highly novel to people who study advocacy strategy; they are moderately new to general audiences but still close to existing common-sense ideas."
  },
  "PostInferentialSupport": {
    "post_id": "AeqNocbAiCiKofT5w",
    "reasoning_quality": 6,
    "evidence_quality": 3,
    "overall_support": 5,
    "explanation": "The post is logically coherent and well-structured: it frames the problem, offers a simple formal model, identifies plausible mechanisms (salience, legitimacy, trust, polarization) and weighs trade-offs for single- vs multi-issue positioning. It explicitly recognizes context dependence and counterarguments. However, many claims rest on untested assumptions and intuition (e.g., how supporters react, salience dynamics, threshold models) and some arguments rely on anecdote (a tweet, the author's experience in Turkey). There is little systematic empirical evidence, no cited studies or data, and limited calibration of the toy models. The result is a useful conceptual framework and set of hypotheses but weak empirical support; the conclusions are reasonable but need testing and more data to be robust."
  },
  "PostExternalValidation": {
    "post_id": "AeqNocbAiCiKofT5w",
    "emperical_claim_validation_score": 7,
    "validation_notes": "Most major empirical claims in the post are plausible and consistent with published research: (a) there are trade‑offs between specialization and diversification for nonprofits (expertise, mission-drift risk, revenue/advocacy capacity); (b) polarization and partisan sorting reduce cross‑cutting coalitions and make neutral positioning harder; (c) low generalized social trust (e.g., Turkey) makes identity signalling and multi‑issue positioning more salient; and (d) public/political statements can provoke donor/backlash risks. These points are supported by scholarly and practitioner literature. However, several specific claims are more conceptual or context-dependent (e.g., “smaller movements should push multi‑issue norms” or “organisations should rarely change positioning”) and lack definitive, generalizable quantitative evidence — outcomes depend strongly on context, funding structure, legal environment, and country‑level trust/polarization. In short: the post’s core framework and qualitative claims are well supported, but some prescriptive recommendations are normative and case‑specific rather than empirically settled.",
    "sources": [
      "World Values Survey (Wave 7) — Turkey (2017–2020) (trust statistics).",
      "Center for American Progress, \"Trends in Turkish Civil Society\" (summary of low trust & civil society implications).",
      "Determinants of trust in Turkey — European Societies / MIT Press summary (empirical analysis of generalized trust in Turkey).",
      "DeGruyter / Nonprofit research: \"How Competition and Specialization Shape Nonprofit Engagement in Policy Advocacy\" (population ecology / specialization effects on advocacy participation).",
      "The Bridgespan Group / SSIR (June 2024) — study on nonprofit scale, revenue concentration vs diversification (implications for focus/strategy).",
      "Guo, C. & Saxton, G. \"Tweeting Social Change: How Social Media Are Changing Nonprofit Advocacy\" (Nonprofit & Voluntary Sector Quarterly, 2014) — evidence on advocacy tactics, community-building and mobilization.",
      "Takumi Shibaike, \"Small NGOs and Agenda-Setting in Global Conservation Governance: The Case of Pangolin Conservation\" (Global Environmental Politics, 2022) — shows small, specialized NGOs can sometimes set agendas and that effects are case-dependent.",
      "Robert E. Goodin, \"Cross‑Cutting Cleavages and Social Conflict\" (British Journal of Political Science) — theory on cross‑cutting cleavages; plus literature on partisan sorting / polarization (Abramowitz et al., \"Partisans without Constraint\" and related work).",
      "Wagner & Harteveld (2024), and related research on elite cooperation reducing affective polarization (evidence that cooperation signals can affect public attitudes).",
      "Philanthropy / Chronicle of Philanthropy / Nonprofit Quarterly articles (2023–2024) documenting donor backlash, \"tune out\" effects, and practical risks when nonprofits take public political stances (reporting and sector analysis).",
      "Big Duck / practitioner studies and Bridgespan/SSIR pieces on rebranding and 'mission drift' (evidence that changes can succeed if stakeholder-managed, but carry risks)."
    ]
  }
}