{
  "PostValue": {
    "post_id": "aKSparxwkqmkgQjRu",
    "value_ea": 5,
    "value_humanity": 2,
    "explanation": "Useful, practical heuristic for a niche but relevant problem within the EA community: it can influence individual retirement/donation choices and short-term philanthropic flows if adopted, but it is not foundational to EA theory or AI policy and depends heavily on subjective TAI probabilities and other assumptions (health, automation of jobs, UBI, non-AI risks). For general humanity the post is low-impact and largely irrelevant to mainstream retirement planning."
  },
  "PostRobustness": {
    "post_id": "aKSparxwkqmkgQjRu",
    "robustness_score": 2,
    "actionable_feedback": "1) Big modeling mistake: treating the probability that TAI occurs by retirement (X) as a linear scale for how much to save (save X% of normal retirement) ignores utility, tail risks, and the distributional nature of outcomes. For example, a small chance of extinction or severe collapse should often lead a risk-averse person to save more than X% (or buy other forms of downside protection), while a moderate-probability large wealth boom could make saving unnecessary. Actionable fix: either (a) replace or supplement the heuristic with a one-paragraph expected-utility framing (showing when linear scaling fails), or (b) add a short numerical example that demonstrates a realistic counterexample where the heuristic under-saves (and show how risk aversion or fat tails change the result). This will stop readers from uncritically applying a rule that can be an \"own goal.\" \n\n2) Important practical omissions that materially change recommendations: employer matches, tax-advantaged accounts, emergency funds, liquidity needs, and near-term job automation risk. These mean the heuristic will often be the wrong operational advice. Actionable fix: add a short prioritized checklist (e.g., keep emergency fund, take full employer match first, then apply heuristic to additional voluntary contributions; adjust upward if your job is likely to be automated soon; prefer liquid reserves for abrupt income shocks). Explicitly call out matching and tax-advantaged accounts as exceptions where you should save more than the heuristic suggests.\n\n3) Unstated assumptions about donation timing and impact: you recommend donating the money you 'skip' on retirement, but that assumes (a) donations now will remain marginally effective given short TAI timelines, and (b) donated dollars can't be spent post-TAI on equally valuable interventions. Actionable fix: add a brief caveat and guidance—e.g., a sentence advising readers to think about the marginal impact of donations given their personal timeline and cause area (and to prefer funding interventions robust to being overtaken by TAI). If possible, include a one-line decision tree: extinction -> donations wasted, severe collapse -> savings helpful, positive TAI -> philanthropic impact may shift but donating pre-TAI can be high-impact for X-risk reduction. This will make the recommendation practical instead of overly prescriptive.",
    "improvement_potential": "Very useful. The feedback calls out major modelling and practical errors (ignoring utility/tail risks like extinction, and failing to mention employer matches, tax-advantaged accounts, emergency funds, liquidity, and near-term automation risk) that could lead readers to make bad or embarrassing decisions. The suggested fixes are actionable, concise, and wouldn’t overly lengthen the post, and they prevent obvious ‘own-goals’ (e.g. advising people to skip matching or emergency savings). The only missing bit is minor extra nuance on heterogenous risk preferences, but overall this would substantially improve the post."
  },
  "PostAuthorAura": {
    "post_id": "aKSparxwkqmkgQjRu",
    "author_fame_ea": 2,
    "author_fame_humanity": 1,
    "explanation": "I can't identify a widely known EA/rationalist figure named 'Denkenberger🔸' (and the name may be a pseudonym). There are no prominent publications, leadership roles, or frequent public contributions in EA linked to that handle in my knowledge up to 2024. Likely a low-profile or niche forum user with minimal global public presence."
  },
  "PostClarity": {
    "post_id": "aKSparxwkqmkgQjRu",
    "clarity_score": 7,
    "explanation": "Overall clear and easy to follow: strong TLDR, a simple heuristic stated up front, reasonable structure (motivation, heuristic, exceptions, advice). Strengths include readability, practical focus, and acknowledgement of caveats. Weaknesses: the key rule (“save X% as much”) isn’t precisely operationalized (how to apply it to a target retirement sum), the supporting reasoning is high-level rather than quantitative, and a couple of claims (e.g. \"initial calculations indicate...\") are underspecified. Could be tightened by defining terms, giving a short numeric example, and briefly justifying why the heuristic is roughly correct."
  },
  "PostNovelty": {
    "post_id": "aKSparxwkqmkgQjRu",
    "novelty_ea": 3,
    "novelty_humanity": 7,
    "explanation": "The post's core move — scale retirement saving by the probability TAI hasn’t happened by retirement (and give the rest away) — is essentially a straightforward expected‑value application of ideas already common in EA/longtermist discussions about AI timelines, donations, and hedging. Many forum readers have seen similar recommendations (donate more if you expect imminent TAI, save if you expect to need money), so it's only mildly novel as an explicit simple heuristic. For the general educated public, though, the specific application to transformative AI and the neat proportional rule are fairly novel and niche: most people haven't framed retirement planning in these terms, so it would feel new to them."
  },
  "PostInferentialSupport": {
    "post_id": "aKSparxwkqmkgQjRu",
    "reasoning_quality": 4,
    "evidence_quality": 2,
    "overall_support": 3,
    "explanation": "The post offers a simple, intuitively appealing heuristic (save X% equal to the probability TAI does NOT occur before retirement), which is a useful conversation starter and has the virtue of being actionable. However the reasoning is thin and overly simplistic: it effectively treats retirement-need as linear in that probability and ignores risk aversion, partial or phased economic disruption, timing-of-loss issues, substitution effects (UBI, asset returns), liquidity needs, employer matching, and heterogeneity in preferences and jobs. The post gives no empirical evidence or worked quantitative model (only a vague mention of “initial calculations”) and cites no data or detailed scenario analysis, so evidence is very weak. Overall the thesis is plausible as a rough heuristic but is not well-supported for broad prescription; a stronger argument would provide a formal model, address risk aversion and intermediate scenarios, and show empirical or simulated examples."
  },
  "PostExternalValidation": {
    "post_id": "aKSparxwkqmkgQjRu",
    "emperical_claim_validation_score": 5,
    "validation_notes": "Mixed / uncertain. Key empirical building blocks of the post are supported, but many central claims are speculative or normative rather than verifiable. Evidence supports (a) that many AI experts assign non-trivial probabilities to transformative AI within coming decades (so adjusting planning for TAI is reasonable). ([wiki.aiimpacts.org](https://wiki.aiimpacts.org/ai_timelines/predictions_of_human-level_ai_timelines/ai_timeline_surveys/2023_expert_survey_on_progress_in_ai?utm_source=chatgpt.com)) (b) that economists and central bankers expect AI to raise productivity and could be disinflationary over the long run, but effects on wages and distribution are uncertain and heterogeneous. ([bis.org](https://www.bis.org/publ/arpdf/ar2024e3.htm?utm_source=chatgpt.com), [oecd.org](https://www.oecd.org/en/publications/oecd-employment-outlook-2023_08785bba-en/full-report/artificial-intelligence-job-quality-and-inclusiveness_a713d0ad.html?utm_source=chatgpt.com)) (c) that there is community-level discussion (including within EA) about changing saving behaviour in light of short AI timelines (so the behavioral anecdote in the post is plausible). ([forum.effectivealtruism.org](https://forum.effectivealtruism.org/posts/aKSparxwkqmkgQjRu/how-much-money-should-we-be-saving-for-retirement?utm_source=chatgpt.com)). However, stronger empirical claims in the post (e.g., “savings are likely to grow rapidly during TAI,” “costs of living will fall and wages will eventually fall for everyone,” or that one should save exactly X% = P(no-TAI-by-retirement)) are normative or model-dependent and lack robust empirical support — they depend on disputed forecasts about how assets, policy (UBI, redistribution), markets, and technologies will respond to TAI. Where the author notes their heuristic is a simplification, that is appropriate; but readers should treat the specific rule as a heuristic rooted in uncertain forecasts rather than an empirically validated formula. ([bis.org](https://www.bis.org/publ/arpdf/ar2024e3.htm?utm_source=chatgpt.com), [oecd.org](https://www.oecd.org/en/publications/oecd-employment-outlook-2023_08785bba-en/full-report/artificial-intelligence-job-quality-and-inclusiveness_a713d0ad.html?utm_source=chatgpt.com))",
    "sources": [
      "AI Impacts — 2023 Expert Survey on Progress in AI (aggregate forecast; HLMI 50% by ~2047) — (AI Impacts Wiki).",
      "OECD Employment Outlook 2023 — 'Artificial intelligence, job quality and inclusiveness' (review of evidence on AI effects on wages, employment and job quality).",
      "Bank for International Settlements (BIS) Annual Report / chapter on AI and the economy (2024) — discusses productivity gains, firm-level effects and uncertain price/wage dynamics.",
      "Toby Ord, The Precipice (2020) and related interviews — example estimate of non-negligible existential risk from unaligned AI (e.g., ~1-in-10 by 100 years as a published estimate).",
      "EA Forum post (original): 'How much money should we be saving for retirement?' by Denkenberger (Draft Amnesty Week) — the post under review.",
      "EA Forum thread / posts discussing pension behavior in AI-focused orgs (anecdotal evidence about some people reducing pension contributions).",
      "Forecasting Transformative AI / AI expert surveys (Müller & Bostrom 2016; other surveys 2018–2023) — earlier literature showing wide expert disagreement and substantial mass on near-to-mid-term timelines."
    ]
  }
}