{
  "PostValue": {
    "post_id": "FrGfYActTqTDyrkaP",
    "value_ea": 4,
    "value_humanity": 1,
    "explanation": "This is an event announcement for a regional EA conference. It’s useful and relevant to the EA/rationalist community (especially people in Central/Eastern Europe) because it facilitates networking, recruitment, skill-building, and discovery of projects and collaborations that could lead to real impact. However the post itself is not a foundational argument or novel research — its truth or falsehood has low systemic consequences — so it’s of modest importance to EA decision-making. For general humanity it’s essentially irrelevant outside the small subset of people who might attend."
  },
  "PostRobustness": {
    "post_id": "FrGfYActTqTDyrkaP",
    "robustness_score": 3,
    "actionable_feedback": "1) Missing inclusion / safety / accessibility information (major omission). Action: Add a clear Code of Conduct link and a short paragraph summarising harassment reporting procedures, accessibility provisions (e.g. wheelchair access, captioning/translation, quiet/low-sensory spaces), and any mental-health supports on site. Readers expect this for conferences and it affects whether people apply. Example text: “We follow our Code of Conduct (link). Report incidents to [contact/email] or on-site staff; we offer wheelchair access, a quiet room, and can provide captioning/translation on request—please indicate needs on the application.”\n\n2) Unclear selection criteria, competitiveness, and travel-funding limits. Action: Briefly state how applications are evaluated, whether admission is competitive, expected acceptance rate or capacity, and explicit travel-support caps/prioritisation rules (e.g. max per person, regional priorities). Applicants need this to judge their chance and whether to request travel funding. Example additions: “Applications are reviewed by organisers and prioritised by need/engagement with EA in CEE; we expect to admit ~X% of applicants. Travel grants are limited to £Y per person and prioritised for applicants who cannot otherwise attend.”\n\n3) Ambiguity about costs and language. Action: Clarify that the event has free registration but requests voluntary donations, note what the donation covers (meals/venue) and whether attendees should budget for accommodation/transport beyond travel grants, and state the primary language(s) of sessions. This reduces no-shows and confusion. Example: “Registration is free; suggested donation £70 helps cover venue and food. Accommodation is not provided—plan accordingly. Sessions will be held in English (with [any local-language options] where noted).”",
    "improvement_potential": "Addresses several important, actionable omissions that materially affect whether people apply (safety/accessibility, selection & travel-funding clarity, and language/cost expectations). Fixing these would noticeably reduce applicant confusion and increase inclusivity without overly lengthening the post; they’re not nitpicks but standard conference information readers expect."
  },
  "PostAuthorAura": {
    "post_id": "FrGfYActTqTDyrkaP",
    "author_fame_ea": 1,
    "author_fame_humanity": 1,
    "explanation": "Insufficient information — 'Hana' is a common name and may be a pseudonym. I find no clear or notable presence tied to the EA/rationalist community or broader public sphere. Provide more identifying details (last name, links, works) to reassess."
  },
  "PostClarity": {
    "post_id": "FrGfYActTqTDyrkaP",
    "clarity_score": 8,
    "explanation": "Overall very clear and well-structured: headings, TLDR, target audience, concrete benefits, programme, schedule, costs, and calls to action make the post easy to understand and act on. It persuasively communicates why someone should apply (networking, workshops, opportunity fair, travel support). Weaknesses: a bit long and repetitive (multiple \"Apply now\" CTAs), minor wording issues (\"The event is free, but we kindly ask for donations\" could confuse some readers; a small double \"only\" in the travel-support line), and a few formatting/links could be tightened. These are minor and don’t significantly harm comprehension."
  },
  "PostNovelty": {
    "post_id": "FrGfYActTqTDyrkaP",
    "novelty_ea": 2,
    "novelty_humanity": 3,
    "explanation": "This is primarily a routine conference announcement aimed at EA audiences — logistics, program, speakers, and travel support — which EA Forum readers have seen many times. The only mildly novel elements are the regional focus (Central/Eastern Europe), the specific speaker/workshop lineup (AI & autocracy, biosecurity, animal welfare mix), and the inclusion of a post-conference hackathon and well‑being amenities. For the general public it’s slightly more specific to EA themes but still an ordinary event promotion rather than a new idea."
  },
  "PostInferentialSupport": {
    "post_id": "FrGfYActTqTDyrkaP",
    "reasoning_quality": 6,
    "evidence_quality": 4,
    "overall_support": 5,
    "explanation": "The post is well-structured and makes plausible, coherent claims about the conference’s value (networking, workshops, opportunity fair) and supports those claims with concrete program details (speakers, workshop topics, schedule, travel support). However, its reasoning is primarily promotional and relies on plausibility rather than rigorous argumentation (e.g., it claims one-on-one meetings are most valuable without data, and asserts workshops will 'equip you' without evaluation). Empirical evidence is limited to named speakers and anecdotal phrasing rather than attendee outcomes, metrics, or testimonials, so the overall support for the thesis is moderate but not strongly evidenced."
  },
  "PostExternalValidation": {
    "post_id": "FrGfYActTqTDyrkaP",
    "emperical_claim_validation_score": 8,
    "validation_notes": "Most of the post's concrete claims are corroborated by official EA event materials: the dates (9–11 May 2025), venue, programme and speaker list, Opportunity Fair, the Out Of This Box screening, suggested donation band (£0–£300) and suggested standard donation (£70), use of Swapcard, travel support policy, and application process/deadline as stated on the event page. Evidence comes from the official EAGxPrague event page and the EA Forum announcement itself, plus linked materials (travel policy doc and workshops PDF). One notable inconsistency: a Czech local event page reported an extended application deadline to 2 May 2025, which conflicts with the April 18 deadline shown on the EA event page — and the official page now shows applications are closed. These minor inconsistencies (deadline/closure timing) keep the rating below a perfect score.",
    "sources": [
      "EAGxPrague 2025 — EffectiveAltruism.org event page (9–11 May 2025). https://www.effectivealtruism.org/ea-global/events/eagxprague-2025 (checked via web.run)",
      "Apply now for EAGxPrague2025 — EA Forum announcement by Hana (Mar 19, 2025). https://forum.effectivealtruism.org/posts/FrGfYActTqTDyrkaP/apply-now-for-eagxprague2025-sharpen-your-tools-for-impact-9",
      "EA Forum mirrored post on GreaterWrong (same content). https://ea.greaterwrong.com/posts/FrGfYActTqTDyrkaP/apply-now-for-eagxprague2025-sharpen-your-tools-for-impact-9",
      "EAGxPrague 2025 — Efektivní altruismus (Czech local page) — shows application-deadline extension to 2 May 2025. https://www.efektivni-altruismus.cz/all-events/eagxprague-2025/",
      "EAGxPrague Travel Policy (Google Doc) — travel support details linked in the announcement. https://docs.google.com/document/d/17fVCcRQswmY8uG-_L--6cRssYx7HS5DbPVqGRdhbrRc/",
      "Workshops/Meetups/Organizations PDF linked in post (Google Drive). https://drive.google.com/file/d/1cemo4lufhbryZuUqoJX3w7FnOc7v0b0q/view?usp=sharing",
      "Swapcard (event app referenced for scheduling 1:1s / agenda). https://www.swapcard.com/",
      "Listing / occurrences of 'Out of This Box' AI-safety musical (examples: AI Safety Berlin / lu.ma listings). https://lu.ma/AISafetyBerlin"
    ]
  }
}