{
  "PostValue": {
    "post_id": "gJpJaaYAaC3XW8par",
    "value_ea": 5,
    "value_humanity": 3,
    "explanation": "Moderately useful for the EA/animal‑welfare community: the post surfaces a neglected but large source of sentient suffering (≈4.2 billion ducks slaughtered), which could meaningfully affect campaigning and research priorities within animal welfare cause prioritization. It is not foundational to EA’s biggest debates (e.g., AI or longtermism) and its practical importance depends on tractability and cultural/market factors, so it’s moderately load‑bearing rather than critical. For general humanity the piece is of minor importance: it could influence consumers and regional policy in places where duck consumption is common, but it won’t substantially change broader public priorities or most people’s lives."
  },
  "PostRobustness": {
    "post_id": "gJpJaaYAaC3XW8par",
    "robustness_score": 3,
    "actionable_feedback": "1) Question and qualify the data/comparisons. The claim that ducks are the “second most slaughtered land animal” depends on how FAO/secondary datasets count animals (e.g., species definitions, backyard vs industrial slaughter, live exports) and on comparing raw headcounts rather than biomass or meat yield. Explain your data sources, any known limitations, and (at minimum) show how the message changes if you compare by meat weight or by standardised biomass. Actionable: add one paragraph saying which FAO codes were used, the uncertainty range, and a sentence or figure converting heads→kg of meat (or cite yield-per-animal estimates) so readers can judge the scale appropriately.\\n\\n2) Don’t treat headcount as the sole priority metric without defending that choice. EA-style prioritisation usually requires accounting for intensity of suffering, sentience, lifespan, tractability, and neglectedness. The post assumes more heads = more moral weight, but ducks may differ from chickens in welfare per animal, farm systems, and how easy it is to intervene. Actionable: add a short section acknowledging these alternative variables and (briefly) why headcount still matters here or else caveat the conclusion; if possible include at least qualitative evidence on duck welfare intensity and tractability (e.g., are duck systems similar to broiler chickens or different?).\\n\\n3) Address feasibility and geographic/cultural concentration. If duck consumption is highly geographically concentrated (e.g., specific countries/cuisines) and dominated by small-scale producers or restaurants, campaigning strategies, leverage points, and tractability differ from chicken campaigns. The current post implies a simple advocacy deficit without showing where and how to act. Actionable: include a concise breakdown of where duck slaughter is concentrated, note likely intervention channels (corporate supply-chain wins vs consumer campaigns vs policy), and flag obvious counterarguments (cultural significance, low menu prevalence) so readers understand the practical implications rather than only the moral statistic.",
    "improvement_potential": "Strong, actionable critique that addresses key weaknesses: unqualified reliance on FAO headcounts, treating headcount as the sole moral metric, and ignoring geographic/feasibility differences. These are plausible 'own goals' that could undermine the post’s credibility; fixing them would materially strengthen the argument without requiring excessive lengthening. It’s not a 9–10 because the headline fact (large duck slaughter numbers) is likely correct, so the thesis isn’t overturned — but the suggested caveats and additions are important."
  },
  "PostAuthorAura": {
    "post_id": "gJpJaaYAaC3XW8par",
    "author_fame_ea": 1,
    "author_fame_humanity": 1,
    "explanation": "I find no record of an author or public persona named 'JLRiedi' in EA/rationalist forums, major EA publications, academic databases, or broader public media. Likely a pseudonym or private/obscure individual; please provide links or context if you want a reassessment."
  },
  "PostClarity": {
    "post_id": "gJpJaaYAaC3XW8par",
    "clarity_score": 8,
    "explanation": "Overall very clear: the post is easy to follow, well-structured, and uses striking statistics and links to support the central claim that ducks are a large but overlooked source of slaughter. Strengths include a clear hook, concrete numbers, and the useful framing of the \"small-bodied animal problem.\" Weaknesses: the causal claim about why advocates don’t focus on ducks leans on a few plausible but underdeveloped points (cultural invisibility, menu presence) and could more directly address other barriers or counterarguments. Minor source/presentation clarifications (e.g., explicit FAO citation rather than an intermediary) would improve precision."
  },
  "PostNovelty": {
    "post_id": "gJpJaaYAaC3XW8par",
    "novelty_ea": 5,
    "novelty_humanity": 8,
    "explanation": "For EA readers the core idea is moderately novel: the argument relies on already-known frameworks (focus on slaughter counts, the small-bodied-animal problem) so the conceptual move is familiar, though the specific emphasis on ducks and the FAO statistic (~4.2 billion slaughtered) may be new or underappreciated. For the general public this is considerably more novel — most people would be surprised that ducks are the second most‑slaughtered land animal and that they are largely absent from advocacy discourse, so the post’s central claim and reframing feel quite original to a lay audience."
  },
  "PostInferentialSupport": {
    "post_id": "gJpJaaYAaC3XW8par",
    "reasoning_quality": 6,
    "evidence_quality": 5,
    "overall_support": 5,
    "explanation": "Strengths: The post makes a clear, coherent argument and cites reputable global slaughter statistics (FAO via Faunalytics) and the relevant ‘small-bodied animal’ framing to explain why ducks are numerous. Weaknesses: The piece leans heavily on slaughter counts without sufficient context (meat yield per animal, geographic distribution, welfare severity relative to other species), offers little empirical evidence that advocates neglect ducks (no surveys or campaign analyses), and does not address tractability/impact of campaigning on ducks. Overall, the thesis is plausible and worth attention, but the evidential base and exploration of counterfactors are limited."
  },
  "PostExternalValidation": {
    "post_id": "gJpJaaYAaC3XW8par",
    "emperical_claim_validation_score": 8,
    "validation_notes": "The post’s core empirical claims are well-supported by FAO-based datasets and reputable secondary analyses. Faunalytics (which explicitly uses FAOSTAT) reports ~85.4 billion land animals slaughtered in 2023 and states ducks ≈ 4.2 billion in 2023, and Our World in Data (FAO-based) likewise shows chickens vastly outnumber other land animals and ducks as one of the top non-chicken counts. Major caveats: these figures come from FAO/FAOSTAT country reporting (which Faunalytics notes can be partial or lagged for some species/countries), and year-to-year headcounts for chickens/ducks vary slightly by data cut and publication date (typical chicken estimates are in the mid-70s billion range for recent years). Overall: the post’s numeric claims are accurate and verifiable, with the usual FAO-data caveats about reporting completeness and timing.",
    "sources": [
      "Faunalytics — Global Animal Slaughter Statistics & Charts (uses FAOSTAT). Faunalytics article (April 23, 2025) reporting total land-animal slaughter 85,444,639,663 in 2023 and ~4.2 billion ducks in 2023. https://faunalytics.org/global-animal-slaughter-statistics-and-charts/",
      "Our World in Data — \"More than 80 billion land animals are slaughtered for meat every year\" (FAO-based summary; discusses chickens, ducks, pigs; May 31, 2024). https://ourworldindata.org/data-insights/billions-of-chickens-ducks-and-pigs-are-slaughtered-for-meat-every-year",
      "Food and Agriculture Organization (FAO) / FAOSTAT — underlying source of slaughter/headcount data; summarized in FAO Statistical Yearbook and FAOSTAT datasets (see FAO Statistical Yearbook / FAOSTAT data access). Example: FAO Statistical Yearbook / FAOSTAT references. https://www.fao.org/faostat/en/#data/QCL and https://openknowledge.fao.org",
      "EA Forum post (the item you asked about) — repeats Faunalytics/FAO-based numbers: \"Why Don’t More Animal Advocates Talk About Ducks?\" (JLRiedi). https://forum.effectivealtruism.org/posts/gJpJaaYAaC3XW8par/why-don-t-more-animal-advocates-talk-about-ducks",
      "Vox / OECD-FAO reporting on global chicken slaughter (context for chicken counts; cites OECD/FAO and gives typical chicken figures in the mid-70s billion range for recent years). https://www.vox.com/future-perfect/2023/8/4/23818952/chicken-meat-forecast-predictions-beef-pork-oecd-fao"
    ]
  }
}