{
  "PostValue": {
    "post_id": "HoJCnHtj4Qqkjkgzj",
    "value_ea": 5,
    "value_humanity": 2,
    "explanation": "This is an operational hiring announcement for a high-impact EA organisation. It’s not a foundational argument or new evidence, but it is moderately important to the EA/rationalist community because it affects 80,000 Hours’ capacity to scale, run programs, and recruit talent (and is directly useful to people looking for EA-aligned jobs). For general humanity the post is essentially trivial — any downstream impact on global outcomes would be indirect and small unless the hires substantially changed 80k’s effectiveness over time."
  },
  "PostRobustness": {
    "post_id": "HoJCnHtj4Qqkjkgzj",
    "robustness_score": 3,
    "actionable_feedback": "1) Make location / visa / remote policy crystal clear per role. Right now the post says “London by default”, “remote considered”, and that you can sponsor UK and “potentially” US visas — that’s vague and will deter candidates who need clarity up front. Action: add one short line under each role link (or a small table) stating whether it’s London-only / hybrid / remote-friendly, whether visa sponsorship is available for that role, and any relocation support. If you truly don’t know yet, say so and give the deciding factors (e.g. must overlap with GMT hours; UK right-to-work preferred).\n\n2) Clarify the in-person trial / assessment logistics and payment policy. The post currently says applicants may face a multi-day in-person trial and that payment is conditional on location/right-to-work. That is a major friction point and could discourage strong international applicants. Action: state explicitly whether in-person trials are mandatory, whether remote alternatives exist for international applicants, how much you pay for tests/trials (or a clear payment policy), and whether travel/visa costs are covered. If policy differs by role, say so for each role.\n\n3) Add a one-line summary of the primary responsibilities / seniority per role in this post. You link to separate pages, but many readers will decide whether to click based on a quick scan. Action: include a concise (1–2 sentence) blurb for each advertised role describing the core function and expected seniority (associate vs specialist) so applicants can quickly self-select. This reduces needless clicks and decreases low-quality applications.",
    "improvement_potential": "The three points are high-value, practical fixes that correct important omissions rather than nitpicks. #2 (clarify in-person trial/payment/remote alternatives) is the highest priority — the current vagueness could meaningfully deter strong international candidates and looks unfair, so fixing it avoids an embarrassing 'own goal'. #1 (per-role location/visa policy) and #3 (one-line role summaries) would noticeably reduce wasted applications and improve candidate fit with only a small increase in post length. Overall these changes are critical for recruitment effectiveness but don’t imply the post is fundamentally wrong, so an 8/10 is appropriate."
  },
  "PostAuthorAura": {
    "post_id": "HoJCnHtj4Qqkjkgzj",
    "author_fame_ea": 8,
    "author_fame_humanity": 3,
    "explanation": "80,000 Hours (often appearing as the handle 80000_Hours) is a well-known, influential EA-aligned organization providing career advice, research, and a popular podcast—widely recognized within effective altruism/rationalist circles but largely unknown to the general public outside related academic/nonprofit/policy niches."
  },
  "PostClarity": {
    "post_id": "HoJCnHtj4Qqkjkgzj",
    "clarity_score": 9,
    "explanation": "The post is well-structured and highly comprehensible: clear headings, concise role list with links, explicit salary, location, deadline, application link and process, and a succinct ‘who we’re looking for’ section. It makes its point convincingly and is easy to follow. Minor issues: a bit of repetition (salary and location information appears more than once), a stray '+' character, and the text could be slightly tighter, but these do not materially harm understanding."
  },
  "PostNovelty": {
    "post_id": "HoJCnHtj4Qqkjkgzj",
    "novelty_ea": 2,
    "novelty_humanity": 3,
    "explanation": "This is essentially a routine recruitment announcement. For EA Forum readers it’s not novel — 80,000 Hours and similar EA orgs frequently post hiring rounds and role lists, so the main ideas (growing ops team, roles, pay/benefits, application process) are familiar. To the general public it’s also unremarkable: NGOs and tech-adjacent organisations regularly advertise multiple operations roles and list benefits. The only mildly distinctive elements are the explicit framing around AGI/AI-focused mission, some notable benefits (mental-health allowance, paid trials, 10% self-development time), and flexibility for generalist applicants — but these do not make the post highly original."
  },
  "PostInferentialSupport": {
    "post_id": "HoJCnHtj4Qqkjkgzj",
    "reasoning_quality": 8,
    "evidence_quality": 6,
    "overall_support": 7,
    "explanation": "Strengths: The post is logically organised and the argument for hiring (scaling ops to support growth and mission) is straightforward and coherent. It gives concrete role descriptions, responsibilities, hire process, location/salary, and some relevant quantitative context (staff size, web traffic/subscribers, people advised). Weaknesses: The empirical evidence is limited and partly implicit — metrics are given without sources or clear definitions (e.g. “over a million people visit our site each year” vs “over 10 million readers”), and there is little direct evidence linking the specific hires to measured impact or need beyond general growth statements. Overall the announcement is well-supported for its purpose as a hiring post, but would be weaker if evaluated as rigorous evidence that these hires are the optimal or necessary way to advance the organisation’s mission."
  },
  "PostExternalValidation": {
    "post_id": "HoJCnHtj4Qqkjkgzj",
    "emperical_claim_validation_score": 8,
    "validation_notes": "Most major empirical claims in the post are directly supported by 80,000 Hours’ own public pages and the EA Forum announcement (jobs listed, salary ranges, benefits, application form & deadline, visa sponsorship, and the stated scale-up of operations). Key site metrics and staffing numbers are reported consistently in the hiring posts (e.g. “grown to 35 staff”, ~600k newsletter subscribers, 10M+ readers, operations team ~10 full‑time staff). However, there are modest inconsistencies across 80,000 Hours pages (e.g. older pages / other site sections give different newsletter and advising totals and the ‘meet the team’ listing implies a larger set of named staff/freelancers/advisors than the “35 staff” figure) so a small uncertainty remains about exactly which headcount the organization means (total headcount vs full‑time staff vs including freelancers/advisors). Overall: well-supported by primary sources but with minor internal numeric discrepancies. ",
    "sources": [
      "EA Forum post: “80,000 Hours is hiring for several operations roles” — Effective Altruism Forum (posted Aug 6, 2025). https://forum.effectivealtruism.org/posts/HoJCnHtj4Qqkjkgzj/80-000-hours-is-hiring-for-several-operations-roles",
      "80,000 Hours — Events Associate/Specialist (job listing, published Aug 4, 2025) — confirms roles, salaries, benefits, \"We’ve grown to 35 staff\", subscriber/readership/advising metrics, application deadline and Airtable form. https://80000hours.org/2025/08/events-associate-specialist/",
      "80,000 Hours — IT Security, Data Privacy, and Systems Specialist (job listing, Aug 2025) — confirms role and salary band. https://80000hours.org/2025/08/it-security-and-data-privacy-specialist/",
      "80,000 Hours 'Work with us' / hiring overview (March/2025 job round listing) — lists the specific operations roles being hired. https://80000hours.org/2025/03/podcast-chief-of-staff/",
      "80,000 Hours — Meet the team (organization page, 2025) — public listing of primary staff, freelancers, advisors and board (useful for cross-checking headcount). https://80000hours.org/about/meet-the-team/",
      "80,000 Hours homepage / metrics (site front page showing readership/advising metrics). https://80000hours.org/",
      "Airtable application form referenced in job posts (application form URL). https://airtable.com/app9Ck3fX6IGrjcJo/pagYTthN4y9HS2Gai/form",
      "People operations job description (mentions managing HR for 35+ staff) — corroborates 35+ staff context. https://80000hours.org/2025/08/people-operations-associate-specialist/"
    ]
  }
}