{
  "PostValue": {
    "post_id": "HwoSHayLt4zqqeyun",
    "value_ea": 7,
    "value_humanity": 6,
    "explanation": "This post is a useful, action-oriented pitch to test an under-explored institutional intervention (sortition) that plausibly improves collective decision-making across many EA-prioritized domains. For the EA community it is relatively high‑value because governance quality materially affects global catastrophic risks and because the proposal (small RCTs, citizens’ assemblies to test EA-alignment) is tractable and fundable — so it could change funding priorities and intervention portfolios. For humanity the upside is large (better government decisions could scale to enormous benefits), but practical and political hurdles make impact uncertain and long‑term; the core claims are plausible but not yet decisive, so the idea is important to investigate rather than immediately transformative."
  },
  "PostRobustness": {
    "post_id": "HwoSHayLt4zqqeyun",
    "robustness_score": 3,
    "actionable_feedback": "1) Overstated/fragile cost–benefit claims and unrealistic assumptions — The post uses several back-of-envelope numbers (e.g. $15/hr × 1 hour per voter, $100/hr compensation for lottocrats, a 1% improvement in government efficiency yielding $100B/year, and a 4× presidential-cycle cost for a sortition campaign) without sensitivity analysis or justification. This is a major own-goal because readers will distrust the argument once they see how fragile the arithmetic is. Actionable fixes: (a) either remove the headline monetary ROI claims or replace them with a robustness table that shows how outcomes change under plausible ranges (e.g. compensation $/hr, participation time, effect size of sortition on policy outcomes); (b) justify or replace the ‘‘social cost of uninformed voting’’ metric (wage×time is not an accepted measure of democratic loss — cite literature or use alternative welfare metrics); (c) be explicit about uncertainty and present several plausible scenarios rather than single-point wild-ass-guesses.\n\n2) Insufficient engagement with the capture/expertise/implementation problem when sortition has real power — Much of the evidence cited concerns advisory mini-publics; the post underplays scholarly arguments and practical risks that a sortition body with binding authority could be captured by experts, lobbyists, or staff (and that capture dynamics differ once stakes are real). The rebuttals are too hand-wavy (rotation and ex-post punishments) and rely on jury analogies that don’t map cleanly to legislative power. Actionable fixes: (a) add a dedicated section that summarizes empirical and theoretical work on capture and staff dependence for empowered mini‑publics, and the limits of jury analogies; (b) propose concrete institutional safeguards to be tested (e.g. transparency rules, limits on post-service employment, public auditing bodies, staggered rotations, independent investigation mechanisms, binding recall thresholds, budgetary constraints); (c) design trial protocols that measure capture and expertise failure modes explicitly (pre-registered outcomes, indicators of lobby contact, reliance on staff, decision reversion by elected bodies, and measures of information quality).\n\n3) Political legitimacy, selection bias, and feasibility concerns are underdeveloped — The post jumps from positive results for advisory deliberation to large-scale constitutional recommendations (eliminating elections, electing executives by lot) without grappling with legitimacy, legal constraints, nonresponse/selection bias, international relations, or distributional consequences. Readers will reasonably ask how you move from pilots to real power without causing backlash or making representation worse. Actionable fixes: (a) add a short section on realistic implementation pathways (opt-in pilots, advisory → delegated powers, hybrid bicameral transitions) and the political feasibility risks of each path; (b) discuss sampling problems (nonresponse, self-selection, exclusion of marginalized groups) and mitigation (oversampling, incentives, stratified draws, weighting, mandatory service or penalties for refusal); (c) include measures of legitimacy to be tracked in trials (public acceptance, perceived fairness, willingness to accept decisions) and a plan for staged escalation only if those legitimacy metrics pass thresholds.",
    "improvement_potential": "The feedback targets three central, high-impact weaknesses: fragile ROI arithmetic that undermines credibility, under-addressed capture/expertise risks when sortition has binding power, and weak treatment of legitimacy/feasibility when scaling from pilots to constitutional change. Fixing these would materially reduce the author’s 'own goals' (overconfident claims, naive rebuttals, and leapfrogging from advisory pilots to sweeping reforms) while being actionable and practical to implement without overturning the paper’s core thesis."
  },
  "PostAuthorAura": {
    "post_id": "HwoSHayLt4zqqeyun",
    "author_fame_ea": 1,
    "author_fame_humanity": 2,
    "explanation": "The name John Huang is common and I can't identify a well-known EA/rationalist author by that name. There is no notable presence in EA communities (hence a 1). Globally, several individuals named John Huang exist (e.g., a 1990s US political figure, various academics), but none are broadly famous worldwide as a public intellectual or author (hence a low score of 2). If you can provide a link, affiliation, or work title I can give a more precise rating."
  },
  "PostClarity": {
    "post_id": "HwoSHayLt4zqqeyun",
    "clarity_score": 8,
    "explanation": "Overall the post is well organized and largely easy to follow: it has a clear executive summary, logical sectioning (background, solution, examples, objections, experiments, conclusion), and concrete examples (e.g. the 160‑hour cost comparison and America in One Room results) that support the main point. Argumentation is generally coherent and the proposed research path is explicit. Weaknesses: the piece is long and occasionally repetitive, some key claims (especially around cost/benefit and EA alignment) rely on coarse, speculative arithmetic and could be flagged more clearly as conjecture; a few informal turns of phrase and embedded images/references interrupt flow for a reader scanning the argument. Tightening speculative sections, removing minor repetition, and signposting where claims are hypothetical vs. evidence‑backed would improve conciseness and argumentative sharpness."
  },
  "PostNovelty": {
    "post_id": "HwoSHayLt4zqqeyun",
    "novelty_ea": 3,
    "novelty_humanity": 6,
    "explanation": "For EA Forum readers this is mostly a synthesis of existing, well‑known ideas (sortition, citizens’ assemblies, Fishkin/Guerrero/Abizadeh literature, and calls for experiments). The explicit framing for EA — e.g. lottocratic assemblies to reduce EA practitioners' cognitive load, RCTs in small organizations, and the specific cost–benefit rhetoric — adds some practical detail but is not conceptually novel for that audience. For the general public (an educated non‑EA audience) the package is moderately novel: while citizens’ assemblies and deliberative polling have entered public discourse (Ireland, France, “America in One Room”), the systematic pitch for broad deployment, RCTs, the “lottocratic efficiency” cost framing, and concrete proposals (EA assemblies, using village cash transfers to test governance modes) would be new or surprising to many people."
  },
  "PostInferentialSupport": {
    "post_id": "HwoSHayLt4zqqeyun",
    "reasoning_quality": 6,
    "evidence_quality": 5,
    "overall_support": 5,
    "explanation": "Strengths: The post is well-structured, anticipates major objections (accountability, expertise), and points to relevant literature and empirical work on deliberation (Science review, Fishkin's 'America in One Room', Irish and French citizens' assemblies, jury analogies). The recommendation to run RCTs and small-scale experiments is sensible. Weaknesses: Several important inferential jumps are under-supported — notably the claim that sortition would outperform elections at scale or be reliably less corrupt when given real, sustained power. The empirical evidence cited largely comes from advisory or short-term deliberative mini-publics (which show attitude change and high-quality deliberation) rather than from long-term, binding sortition institutions; many examples also suffered dilution by elected bodies. Cost‑efficiency and payoff calculations rest on crude assumptions and optimistic scaling. Overall, the argument is plausible and worthy of further empirical testing, but the existing evidence is incomplete and too limited to strongly support the bolder policy claims."
  },
  "PostExternalValidation": {
    "post_id": "HwoSHayLt4zqqeyun",
    "emperical_claim_validation_score": 7,
    "validation_notes": "Strengths: The post’s core empirical claims about deliberative mini‑publics (deliberative polls / citizens’ assemblies) producing knowledge gains, measurable opinion shifts, and reductions in partisan affect are well supported by peer‑reviewed research and high‑profile field experiments (e.g., Dryzek et al. 2019 review; Fishkin’s America in One Room results; NORC/Helena project reports). Historical cases cited (British Columbia Citizens’ Assembly 2004 recommending BC‑STV; Ireland’s Citizens’ Assembly leading to the 2018 abortion referendum; France’s 2019–20 Citizens’ Convention for Climate producing many proposals) are accurate and documented. \n\nWeaknesses / caveats: Many of the post’s larger causal and policy claims are more speculative than empirically settled. Evidence showing short‑term opinion change or strong recommendations from advisory assemblies does not by itself prove that (a) sortition-based institutions will reliably scale to wield sustained legislative power, (b) they will be more corruption‑resistant in practice, or (c) they will systematically produce outcomes more aligned with Effective Altruist priorities. The author’s cost examples (the $10T government spending figure, and the simple $/hour cost comparison) are illustrative but rest on debatable assumptions (e.g., whether the $10T refers to federal-only outlays vs. total government spending; choice of hourly compensation; scalability and external validity). Important scholarly critiques (e.g., Landa & Pevnick 2020) raise accountability and capture risks that the post acknowledges but cannot resolve without larger‑scale empirical tests. \n\nOverall judgement: Most of the post’s factual examples and the empirical literature it cites are accurate and supportive of the claim that deliberative mini‑publics can improve deliberation and reduce polarization in measured contexts; however, its stronger normative and scaling claims about sortition as a wholesale replacement for elections or as reliably better for EA priorities remain speculative and only partially empirically supported. Hence a “well‑supported but with important uncertainties” score of 7.",
    "sources": [
      "Dryzek JS et al., \"The crisis of democracy and the science of deliberation,\" Science, 2019. (Dryzek et al. 2019 review).",
      "Fishkin JR et al., \"Is Deliberation an Antidote to Extreme Partisan Polarization? Reflections on 'America in One Room'\", American Political Science Review (APSR), 2021. (Deliberative Poll / America in One Room results).",
      "NORC / Deliberative Democracy Lab project page and Helena project pages for \"America in One Room\" and \"America in One Room: Climate and Energy\" (project descriptions and post‑deliberation results / convergence findings).",
      "Citizens' Assembly on Electoral Reform (British Columbia) — Final Report, 2004 (UBC Citizens' Assembly site documenting BC‑STV recommendation).",
      "BBC / Participedia / Irish Government reporting on the Irish Citizens' Assembly and its role in the process leading to the 2018 referendum (Thirty‑sixth Amendment) on abortion.",
      "Coverage and primary documents on the French \"Convention citoyenne pour le climat\" (results and government response; e.g., Connexion France, Democracy International summaries).",
      "Landa D. & Pevnick R., \"Is Random Selection a Cure for the Ills of Electoral Representation?\", Journal of Political Philosophy, 2020 (critique on accountability/capture).",
      "OpenSecrets analysis: \"Most expensive ever: 2020 election cost $14.4 billion\" (Feb 11, 2021) — supports the post’s campaign‑cost context.",
      "Congressional Budget Office / OMB FY2024 budget reports showing total federal outlays ≈ $6.7–6.8 trillion (illustrates ambiguity of the author’s $10T figure depending on whether total government vs federal only was intended).",
      "Stanford Encyclopedia of Philosophy, \"The Ethics and Rationality of Voting\" (Jason Brennan summary) — on the decisive‑vote probability (order‑of‑magnitude ~1 in 10 million in some models) and rational ignorance."
    ]
  }
}