{
  "PostValue": {
    "post_id": "jEDwjXAS8J5TYzhng",
    "value_ea": 3,
    "value_humanity": 1,
    "explanation": "This is a job advertisement for an EA-affiliated organisation. Its truth and outcomes mainly affect CEEALAR and its local/regional EA community (operations, fundraising, ability to host events/residents), so it has modest importance to people deciding where to work or how the hub functions. It is not foundational to EA theory or strategy. For general humanity the post is effectively trivial."
  },
  "PostRobustness": {
    "post_id": "jEDwjXAS8J5TYzhng",
    "robustness_score": 3,
    "actionable_feedback": "1) Missing organisational context and impact data (high priority). EA readers need concise evidence that this role is high-impact: current annual budget, funding runway, occupancy/usage metrics for the hotel, team size and structure, recent outcomes or KPI examples, and who the ED reports to (Board, Chair, someone else). Actionable fix: add a short paragraph with 3–5 concrete numbers (annual budget, months of runway, staff headcount, occupancy% or guests/year, number of funded programs/partners) and a one-sentence summary of the charity’s mission and demonstrated impact.\n\n2) Unclear role scope and expectations / contradictory time commitments. The post says \"full time\" but also \"pro rata\" and gives an odd onsite expectation (initial 3 months living on site then at least 1 day/month). It’s also unclear which authorities the ED will have (control of bank accounts, hiring/firing, fundraising targets vs board approval). Actionable fix: state whether the role is full-time or pro-rated, exactly how much onsite time is expected after onboarding (e.g. 1 day/week vs 1 day/month), clarify reporting lines and decision rights, and include 3–5 concrete deliverables or success metrics for the first 6–12 months (e.g. implement accounting system, secure X months of funding, reach occupancy or program targets).\n\n3) Compensation and benefits omissions and competitiveness concerns. Given the breadth of responsibilities (strategy, finance, payroll, fundraising, HR, hospitality) the advertised salary band may under-signal seniority; also important benefits details are missing (pension, sick pay, employer NI, relocation support, whether accommodation is provided during the initial 3-month on-site period). Actionable fix: clarify total compensation package (pension and statutory benefits), whether the listed salary is full-time or pro rata, confirm whether accommodation/food is included during the initial 3-month on-site period and afterwards, and consider benchmarking the salary or explicitly noting why the band is appropriate (e.g. strong benefits, mission-driven tradeoffs, or scope limits).",
    "improvement_potential": "Targets the post’s biggest shortcomings for an EA audience: missing organisational context/impact metrics, ambiguous role scope and onsite expectations, and unclear total compensation. The suggestions are actionable and high-priority yet concise (add a short numbers paragraph and specific deliverables/decision-rights) so they improve signal-to-noise without unduly lengthening the post. Not perfect (could also flag undefined acronym/name clarity and candidate relocation logistics), but overall very useful."
  },
  "PostAuthorAura": {
    "post_id": "jEDwjXAS8J5TYzhng",
    "author_fame_ea": 1,
    "author_fame_humanity": 1,
    "explanation": "I cannot find evidence that 'CEEALAR' is a recognized figure in the EA/rationalist community or in wider public discourse. The name appears to be a pseudonym/handle with no notable publications, conference appearances, or citations known to me. If you can share links or context (posts, articles, platform), I can reassess."
  },
  "PostClarity": {
    "post_id": "jEDwjXAS8J5TYzhng",
    "clarity_score": 8,
    "explanation": "Well-structured and easy to read: clear headings (role, duties, person spec, compensation, application steps) make the requirements and process obvious. Minor weaknesses: some repetition (salary stated twice), a small ambiguity around 'full time' vs 'pro rata', and the onsite requirement (initial 3-month stint then 1 day/month) could be clarified. Overall concise and accessible for its purpose."
  },
  "PostNovelty": {
    "post_id": "jEDwjXAS8J5TYzhng",
    "novelty_ea": 2,
    "novelty_humanity": 3,
    "explanation": "This is essentially a standard job posting for an EA organisation — the structure, responsibilities and person-spec are all very familiar to EA Forum readers, so it has low novelty for that audience. The only mildly unusual features are the EA-hotel context (CEEALAR as an EA-run lodging), the initial on-site living/working period, and visa/accommodation offerings, which make it a bit more novel to the general public but still not a very original idea overall."
  },
  "PostInferentialSupport": {
    "post_id": "jEDwjXAS8J5TYzhng",
    "reasoning_quality": 5,
    "evidence_quality": 2,
    "overall_support": 3,
    "explanation": "Strengths: The post is clear, well-structured and communicates role responsibilities, candidate expectations, and compensation concisely. It logically lays out what the ED would do and what skills are required, which helps assess fit. Weaknesses: Key claims (e.g. 'high-impact role', scope for growth, funding prospects) are asserted but not supported with evidence — no metrics on CEEALAR’s past impact, budget, occupancy/funding history, or concrete growth targets. There is little empirical or third‑party evidence about organisational effectiveness, risks, or success measures. Overall the ad is useful for evaluating role content but offers weak empirical support for its claims about impact and growth potential."
  },
  "PostExternalValidation": {
    "post_id": "jEDwjXAS8J5TYzhng",
    "emperical_claim_validation_score": 7,
    "validation_notes": "Most major factual claims in the post are verifiable and supported by primary sources: the EA Forum job post itself (salary band, location, dates, duties, benefits, application link) and the organisation's own website and Charity Commission record (organisation exists, Blackpool address, provides accommodation/board). One notable claim is under-supported: the post says “We can provide a UK Skilled Worker visa if needed.” I could not find CEEALAR / “Centre for Enabling EA Learning & Research” on the UK Home Office Register of Licensed Sponsors (the authoritative public list of organisations that can issue Skilled Worker certificates). CEEALAR’s website mentions providing immigration support letters, which is not the same as holding a sponsor licence. That discrepancy lowers confidence slightly — recommend verifying sponsorship capability directly with CEEALAR before relying on that claim.",
    "sources": [
      "EA Forum — Job: Executive Director of CEEALAR (EA Hotel) (post by CEEALAR, Mar 3 2025): https://forum.effectivealtruism.org/posts/jEDwjXAS8J5TYzhng/job-executive-director-of-ceealar-ea-hotel",
      "CEEALAR website — Apply / Visas info (pages referencing accommodation, visa support letters): https://www.ceealar.org/apply/apply (see 'Visas...' and 'Staying at CEEALAR')",
      "CEEALAR website — Home / 'The EA Hotel' overview: https://www.ceealar.org/home",
      "Charity Commission register — CENTRE FOR ENABLING EA LEARNING & RESEARCH, charity no. 1189768 (contact, finances, address 36 York St, Blackpool): https://register-of-charities.charitycommission.gov.uk/charity-search/-/charity-details/5148547",
      "Companies House overview — CENTRE FOR ENABLING EA LEARNING & RESEARCH (CE022043): https://find-and-update.company-information.service.gov.uk/company/CE022043",
      "GOV.UK — Register of licensed sponsors: workers (authoritative list to check whether an organisation can sponsor Skilled Worker visas): https://www.gov.uk/government/publications/register-of-licensed-sponsors-workers"
    ]
  }
}