{
  "PostValue": {
    "post_id": "jGSBhzWHHHbDwxtwk",
    "value_ea": 6,
    "value_humanity": 4,
    "explanation": "This post is a useful and timely prompt for the EA community: up-to-date, published net assessments of existential/catastrophic risks are important inputs for priority-setting, funding, and strategy, and a lack of publicly available assessments (or clear reasoning for that lack) is worth investigating. However, the post is primarily a solicitation / meta-question rather than new evidence or argumentation, so its direct load-bearing value is moderate rather than foundational. For general humanity the issue matters (x-risk estimates shape major policy), but this specific forum query is of limited direct impact unless it catalyses widespread new assessments or policy changes."
  },
  "PostRobustness": {
    "post_id": "jGSBhzWHHHbDwxtwk",
    "robustness_score": 3,
    "actionable_feedback": "1) Define key terms and narrow the scope. Right now the post asks for \"net assessments\" of \"x-risks\" without saying what counts as either term (military-style net assessment? comparative risk-benefit analyses? peer‑reviewed papers, policy reports, or think‑tank briefings?), or what timeframe \"recent\" means. Actionable fix: state whether you mean (a) peer‑reviewed literature, (b) public policy/think‑tank reports, or (c) declassified government assessments, and give a concrete cutoff (e.g. last 5 years). Also clarify which x-risk domains you care about (bio, nuclear, climate, misaligned AI, systemic geopolitical collapse) — different communities and publication norms apply to each. This will make responses more useful and keep answers short and on‑target.\n\n2) Engage existing work and plausible reasons for scarcity. The post assumes there are \"so few\" published assessments but doesn’t acknowledge why that might be true (academic incentives, classified material, commercial/strategic sensitivity, or simply that assessments exist in adjacent forms). Actionable fix: add a short sentence summarizing what you already know (examples you’ve checked) and ask targeted follow‑ups: e.g. “Are there recent public net assessments of catastrophic biological risk (2018–2025)?” This both avoids reinventing the wheel and invites corrections/citations. If you want, mention a few places readers should check (e.g. Future of Humanity Institute, Global Priorities Institute, RAND/CSIS/NTI reports, National Academies, IPCC for climate) so respondents can point to gaps rather than retread known sources.\n\n3) Reframe speculative/political scenarios and add safety/ethics guardrails. The paragraph about \"Trump2\" and acts of war/genocide reads as wide, speculative, and could be misinterpreted as fishing for tactics that may be harmful or classified. Actionable fix: either frame such scenarios explicitly as high‑level, normative prompts for scenario analysis (e.g. “How would illiberal shifts change incentive structures for state and non‑state actors?”) or remove the provocative examples. Add a brief safety/ethics note asking respondents not to share operational/illicit advice and to keep discussion at the level of policy, incentives, and ethical considerations. That keeps the post publishable on EA Forum and focuses replies on constructive, public‑facing work.\n\nImplementing these three changes will make the post much easier to answer, reduce noise from speculation, and increase the chance of getting concrete citations and usable suggestions for new opportunities.",
    "improvement_potential": "The feedback identifies the post’s main weaknesses: key-term vagueness (what counts as a ‘net assessment’, which x‑risks, and what timeframe), an unexamined assumption that assessments are scarce, and a potentially risky/polemical framing (the Trump2/war/genocide examples). All three points are actionable and would materially improve answer quality and safety without greatly lengthening the post. It could be slightly stronger by offering a couple more concrete example sources or by noting that different audiences (academics vs. policymakers) expect different evidence, but overall it targets major problems and prevents predictable low‑value or hazardous replies."
  },
  "PostAuthorAura": {
    "post_id": "jGSBhzWHHHbDwxtwk",
    "author_fame_ea": 1,
    "author_fame_humanity": 1,
    "explanation": "No recognizable presence for ‘different Sam’ (possibly a pseudonym) in EA/rationalist communities or the broader public up to 2024 — no notable publications, talks, or citations found. Provide links or context if you’d like a reassessment."
  },
  "PostClarity": {
    "post_id": "jGSBhzWHHHbDwxtwk",
    "clarity_score": 8,
    "explanation": "The post is generally clear and focused: it asks why there are few recent published \"net assessments\" of existential/catastrophic risks (excluding AI), gives geopolitical context, and invites discussion about new opportunities or threats under illiberal shifts. Strengths are its direct questions and topical framing (e.g. Trump2, EAG London). Weaknesses are minor ambiguity about key terms (what exactly the author means by \"net assessments\" and what counts as \"published\"), a few slightly awkward or provocative phrasings that could distract, and multiple related sub-questions that could be tightened or separated for greater precision."
  },
  "PostNovelty": {
    "post_id": "jGSBhzWHHHbDwxtwk",
    "novelty_ea": 3,
    "novelty_humanity": 5,
    "explanation": "For an EA/longtermist audience the post raises familiar points: that most x‑risk work is sensitive or government‑held, that geopolitical shifts change incentives, and that this creates both new threats and opportunities. Those connections and the call for recent published ‘‘net assessments’’ are not new to readers who track policy and security. To a general educated reader the combination is somewhat less obvious — the specific focus on a dearth of recent, public, cross‑domain net assessments and the prompt to look for new moral‑actor opportunities under illiberal political shifts is moderately novel, though still grounded in broadly discussed themes (government secrecy, geopolitical risk, and policy tradeoffs)."
  },
  "PostInferentialSupport": {
    "post_id": "jGSBhzWHHHbDwxtwk",
    "reasoning_quality": 3,
    "evidence_quality": 1,
    "overall_support": 2,
    "explanation": "The post raises interesting and plausible questions (e.g., that much risk assessment happens inside governments and that geopolitical shifts could change what actions are on the table), but it is primarily speculative and underspecified. It lacks definitions (what counts as a \"net assessment\"), structured argumentation, and any citations or empirical examples to support its claims. To be more convincing it would need recent literature references, case studies or declassified assessments, and clearer argument chains about how specific political changes translate into altered risk profiles or opportunities for moral actors."
  },
  "PostExternalValidation": {
    "post_id": "jGSBhzWHHHbDwxtwk",
    "emperical_claim_validation_score": 5,
    "validation_notes": "Mixed / uncertain. The post’s central empirical claim — that there are “so few recent published net assessments” of existential/global‑catastrophic risks — is not well supported: multiple substantial, recent public assessments and a rapidly growing academic literature exist (e.g., RAND’s 2024 Global Catastrophic Risk Assessment; a 2025 bibliometric review documenting expansion of the GCR/ER literature; several arXiv/academic papers and books from 2020–2025). At the same time the author’s secondary claim — that much risk assessment/mitigation happens inside governments and is not publicly shared — is supported by longstanding practices (classified National Intelligence Estimates, national pandemic exercises such as Crimson Contagion, selective declassification practices). The geopolitical/“illiberal shifts” premise is also empirically plausible and supported by multiple democracy/authoritarianism trackers showing global democratic backsliding. In short: the complaint that there are “so few” public net assessments is overstated given recent public reports and peer‑reviewed/working‑paper literature, but concerns about classified government work and changing geopolitical incentives are supported by the evidence.",
    "sources": [
      "RAND — Global Catastrophic Risk Assessment (report page, Oct 30, 2024).",
      "Jehn et al., 'The state of global catastrophic risk research: a bibliometric review' (Earth System Dynamics / ESD, 22 Jul 2025).",
      "ARCHES: 'AI Research Considerations for Human Existential Safety' (Andrew Critch & David Krueger, arXiv, 2020).",
      "Bucknall & Dori‑Hacohen, 'Current and Near‑Term AI as a Potential Existential Risk Factor' (arXiv, 2022).",
      "Growiec & Prettner, 'The Economics of p(doom): Scenarios of Existential Risk and Economic Growth...' (arXiv, Mar 2025).",
      "Toby Ord, The Precipice: Existential Risk and the Future of Humanity (book, 2020) — prominent public assessment.",
      "Future of Humanity Institute (official statement / website noting closure, 16 Apr 2024) and contemporaneous coverage (The Guardian, Apr 2024) — example of institutional changes in the field.",
      "National Intelligence Council / National Intelligence Estimate descriptions (U.S. IC — NIC/NIE; Belfer Center explainer) — demonstrates government internal classified estimative practice.",
      "Crimson Contagion (U.S. interagency pandemic simulation, 2019) and reporting on its findings — example of government exercises not designed as public academic publications.",
      "Freedom House — 'Freedom in the World 2025' press release (reports 19th consecutive year of global freedom decline; 2024 trends).",
      "Our World in Data / V‑Dem reporting and press coverage summarizing global democratic backsliding (2023–2025 coverage).",
      "Time / reporting on selective declassification and intelligence‑sharing practices (recent analyses of U.S. declassification use)."
    ]
  }
}