{
  "PostValue": {
    "post_id": "jqomhaK8Anv7TBPcv",
    "value_ea": 5,
    "value_humanity": 2,
    "explanation": "A useful, practical resource for people in the EA/rationalist community seeking higher-impact careers. It can modestly improve career matching, job-hunting effectiveness, and the flow of talent into high-impact roles, so it has moderate importance for EA decision-making and outreach. It is not a foundational or novel theoretical claim, and its absence would not dramatically change major EA conclusions. For general humanity the effect is minimal — helpful to individuals who use it but negligible at society-wide scale."
  },
  "PostRobustness": {
    "post_id": "jqomhaK8Anv7TBPcv",
    "robustness_score": 3,
    "actionable_feedback": "1) No evidence or credibility for effectiveness — The post announces a revised guide but gives readers no sense of who made it, why they’re credible, or whether the guide actually helps. Actionable fixes: add the author(s)’s relevant credentials or experience, summarize any evaluation/usage metrics (e.g. number of users, advising success rates, A/B tests, follow-up surveys), or include a short anonymized case study or testimonial showing concrete outcomes.\n\n2) Too promotional and link-heavy; missing a concise summary of what’s new or important — Right now the post mostly links to the guide without describing why readers should click. Actionable fixes: include 2–4 concrete bullets summarizing the major changes in this revision, the most important practical recommendations from the guide, and one short example of actionable advice readers can use immediately. That will increase value for readers who skim and reduce the “announce-only” promotional feel.\n\n3) Unclear target audience, costs, and conflicts of interest — The post claims the guide is for “people at all stages” and promotes advising signups, but doesn’t state who will benefit most, whether advising is paid, or how you handle conflicts/privacy. Actionable fixes: specify the ideal reader profile (e.g. early-career EA, mid-career pivot, etc.), clearly state whether 1:1 advising is free or paid and typical time/price commitments, and add a short transparency note about any selection criteria, funding sources, or potential conflicts of interest.",
    "improvement_potential": "This feedback hits the post’s three biggest weaknesses: lack of credibility/evidence, skim-unfriendly announce-only format, and unclear audience/pricing/conflict transparency. Each point is actionable and can be implemented with a small amount of added text (author credentials, 2–4 bullets summarizing changes/value, and a short note on advising costs/selection). These changes would meaningfully improve trust and click-through quality without bloating the post; they aren’t catastrophic errors but are important omissions the author should fix."
  },
  "PostAuthorAura": {
    "post_id": "jqomhaK8Anv7TBPcv",
    "author_fame_ea": 1,
    "author_fame_humanity": 1,
    "explanation": "No clear or widely recognized person/pen-name 'Probably Good' in EA or rationalist communities or in broader public discourse based on available information. Likely a pseudonymous/low-profile online handle; please provide links or more context if you want a re-evaluation."
  },
  "PostClarity": {
    "post_id": "jqomhaK8Anv7TBPcv",
    "clarity_score": 9,
    "explanation": "Clear, well-structured and concise announcement: purpose is stated up front, key contents and audience are described, and next steps (signup, advising, contact) are easy to find. Minor weaknesses: it could briefly note what’s new in the revision and who the primary intended audience is (e.g. level of experience or EA alignment) and avoid many inline links breaking flow, but these are small issues."
  },
  "PostNovelty": {
    "post_id": "jqomhaK8Anv7TBPcv",
    "novelty_ea": 2,
    "novelty_humanity": 3,
    "explanation": "For an EA audience this is not very novel — it largely repackages well-known EA career-advice topics (matching motivations, career hypotheses, application strategies) already covered by 80,000 Hours, EA Forum posts, and other orgs. The main newness is an updated/organized guide, email-serialized summaries, and 1:1 advising. For the general public the focus on explicitly \"impactful\"/EA-style careers is a bit less common than generic career advice, but the underlying ideas and services (career guides, job-application help, coaching) are familiar, so overall still low novelty."
  },
  "PostInferentialSupport": {
    "post_id": "jqomhaK8Anv7TBPcv",
    "reasoning_quality": 3,
    "evidence_quality": 2,
    "overall_support": 2,
    "explanation": "Strengths: The post clearly summarizes the guide’s scope and intended audience and lays out concrete topics covered, which makes the claim plausible. Weaknesses: It offers no evidence that the guide actually improves outcomes (no user data, testimonials, success metrics, studies, or examples), and it makes an implicit effectiveness claim without justification. The argumentative content is minimal and mostly promotional rather than evidence‑based. To be more convincing the post would need empirical results, user feedback, or more detail about how the recommendations were developed and validated."
  },
  "PostExternalValidation": {
    "post_id": "jqomhaK8Anv7TBPcv",
    "emperical_claim_validation_score": 8,
    "validation_notes": "Most factual claims in the post are verifiable and accurate: the Probably Good career guide exists online, the guide is organized into 8 chapters and includes the specific topics the post lists (matching motivations, mapping options/career hypotheses, how to land jobs, diagnosing/overcoming obstacles, etc.), and the site offers an email/newsletter signup and a free 1:1 advising application and contact form. These items are directly shown on Probably Good’s website. The only weaker claim is the wording “significantly revised version” — that is partly subjective and I found evidence of past updates (EA Forum posts announcing new chapters in 2022 and the org’s 2020 introduction) but no explicit public changelog phrasing I could find that labels the current guide as a single, newly “significantly revised” release. Overall: well-supported but with one subjective claim that couldn’t be fully corroborated as a discrete “significant revision” event from public pages.",
    "sources": [
      "Probably Good — Career Guide landing page (Career Guide: How to Do Good With Your Work). https://probablygood.org/career-guide/",
      "Probably Good — 'Matching your motivations to good opportunities' (chapter page). https://probablygood.org/career-guide/analyzing-cause-areas/",
      "Probably Good — 'Mapping your options with career hypotheses' / 'Structuring Your Decision' (chapter pages). https://probablygood.org/career-guide/mapping-options/ and https://probablygood.org/career-guide/structuring-your-decision/",
      "Probably Good — 'How to actually land a good job' / 'Where to find an impactful job' / 'Overcoming obstacles' (chapter pages). https://probablygood.org/career-guide/finding-jobs/ and https://probablygood.org/career-guide/resolving-your-uncertainties/ and https://probablygood.org/career-guide/how-to-apply-this/",
      "Probably Good — Personal Career Advising / Advising application pages (1:1 advising). https://probablygood.org/advising/ and https://probablygood.org/advising-application/",
      "Probably Good — Contact page (contact form / team email). https://probablygood.org/contact/",
      "EA Forum — 'Introducing Probably Good: A New Career Guidance Organization' (Nov 2020). https://forum.effectivealtruism.org/posts/3QufK3jjQ5aqksaJu/new-career-guidance-organization-probably-good",
      "EA Forum — 'Two new chapters in the Probably Good Career Guide' (Jul 24, 2022). https://forum.effectivealtruism.org/posts/2NBrGtonkT6Ea5H6d/two-new-chapters-in-the-probably-good-career-guide"
    ]
  }
}