{
  "PostValue": {
    "post_id": "jvYaDeWpCa52PTHrm",
    "value_ea": 4,
    "value_humanity": 2,
    "explanation": "This is a useful, actionable opportunity for a narrow audience (social-impact/food-system entrepreneurs and funders). It could produce some high-impact projects (protein transition, animal welfare, climate-friendly food tech) but is not foundational to EA priorities such as longtermism or AI safety. The direct global-scale impact is possible but limited and contingent on which startups succeed, so the post is of minor importance to EAs and low importance to humanity at large."
  },
  "PostRobustness": {
    "post_id": "jvYaDeWpCa52PTHrm",
    "robustness_score": 3,
    "actionable_feedback": "1) Explain expected impact and selection criteria so EA readers can judge cost-effectiveness. The post claims “massive impact” but gives no theory of change or outcomes. Add (briefly): the kinds of cause areas you prioritize (e.g. protein transition, farm animal welfare, supply-chain emissions), the selection criteria (impact, scalability, evidence), what success looks like for a graduating initiative, and any evaluation or follow-up metrics you track (e.g. active businesses after 1 year, tonnes CO2/animal welfare improvements attributable, funding raised). If you can’t quantify, say so and explain why. This lets readers assess counterfactual value rather than treat it as generic “impact.”\n\n2) Be transparent about funding terms and magnitude. Say how the $200k is typically split (awards per team vs. prizes), whether funding is grants or equity/convertible notes, any repayment or IP/licensing expectations, and who covers travel/visa costs beyond the two weeks. State expected team-level award sizes (range or examples from past cohorts). Lack of these details is a common “own goal” that discourages serious applicants and raises red flags for funders.\n\n3) Clarify eligibility, time commitment, and evidence of past cohort outcomes. Say who should apply (founders vs. early-stage teams, academic projects, geographic restrictions), the average weekly time commitment during the 15 weeks, and whether participants receive stipends. Add 1–2 concrete metrics/anecdotes about past cohorts (e.g. number of startups still active, follow-on funding obtained, pilot partnerships secured) or link to an alumni outcomes page. Also disclose organizational relationships/conflicts (e.g. role of ProVeg) so readers can judge credibility. These additions are short but materially improve trust and reduce follow-up questions.",
    "improvement_potential": "The feedback targets several substantive weaknesses for an EA audience: unsupported claims of “massive impact,” lack of a theory of change/selection criteria, opaque funding terms, and missing eligibility/time-commitment and alumni outcomes. Those are the kinds of 'own goals' that make a short announcement look unserious to cost-effectiveness-focused readers and deter high-quality applicants. The suggested fixes are concrete and brief, so applying them would materially improve credibility without unduly lengthening the post."
  },
  "PostAuthorAura": {
    "post_id": "jvYaDeWpCa52PTHrm",
    "author_fame_ea": 1,
    "author_fame_humanity": 1,
    "explanation": "As of my 2024-06 knowledge cutoff, 'Che Green 🔸' is not a recognized name in EA/rationalist communities or the broader public. No major publications, talks, or citations are known to me; the name may be a pseudonym or a very new/very niche author. If you can share links or context (platform, works), I can reassess."
  },
  "PostClarity": {
    "post_id": "jvYaDeWpCa52PTHrm",
    "clarity_score": 8,
    "explanation": "Overall clear and easy to understand: the post gives the program name, duration, funding amount, format (virtual + in‑person), examples of past cohorts, deadline, and a link to apply. It has a strong call to action and is well structured. Minor weaknesses: a small grammatical inconsistency (“One can apply with your own idea or you can pick…”), a bit of repetition, and missing specifics that would improve persuasiveness (eligibility, selection process, expected time commitment or location details beyond Berlin). Fixing those would push it toward a 9–10."
  },
  "PostNovelty": {
    "post_id": "jvYaDeWpCa52PTHrm",
    "novelty_ea": 2,
    "novelty_humanity": 3,
    "explanation": "This is primarily an announcement for an existing incubator rather than a new concept or argument. EA readers routinely see calls for incubators, grants, and food-system interventions, so it is not very novel (small novelty from program-specific details like the ProVeg/Berlin connection and exact funding terms). For the general public it's also common—incubators and social-impact startup calls are widespread—though the specific focus and partners give it slightly more distinctiveness than a completely generic program posting."
  },
  "PostInferentialSupport": {
    "post_id": "jvYaDeWpCa52PTHrm",
    "reasoning_quality": 4,
    "evidence_quality": 3,
    "overall_support": 3,
    "explanation": "The post is primarily promotional and its arguments are straightforward but not rigorously developed. Strengths: it gives concrete program details (15-week length, $200k total grants, travel funding), names past participants, and cites an established partner (ProVeg), which lends some credibility. Weaknesses: it makes aspirational claims about \"massive impact\" without presenting measurable outcomes, alumni success metrics, follow-on funding, selection criteria, or independent evaluation. The evidence is therefore relevant but thin and insufficient to support the stronger claims about changing the world’s food system."
  },
  "PostExternalValidation": {
    "post_id": "jvYaDeWpCa52PTHrm",
    "emperical_claim_validation_score": 8,
    "validation_notes": "Most empirical claims in the post are accurate and are confirmed by primary sources (the Kickstarting For Good website and ProVeg/ProVeg Incubator press releases/pages): K4G is operating (third cohort in 2025), the programme is advertised as a 15‑week incubation with two in‑person weeks in Berlin, travel/accommodation stipends are provided, applications for 2025 were open with an April 30 deadline, applicants may join with their own idea or take pre‑identified idea areas, and many named alumni (InterVeg, Farm Adaptation Network, Electric Sheep, Protein Transition Switzerland, Vegan Business Circle / AVA Summit) are documented as participating or stemming from the programme. Minor inconsistencies exist across different pages/years: earlier writeups describe shorter pilot/cohort lengths (8–14 weeks in 2023–2024) and some press pages list prize breakdowns summing to US$150k while the Kickstarting For Good site advertises a total of US$200k in grants/seed funding — this likely reflects changes between cohorts or inclusion of additional seed grants beyond the headline prize tiers. Overall the post’s claims are well supported with small, explainable discrepancies in program-length and exact funding breakdown between different cohort descriptions.",
    "sources": [
      "Kickstarting for Good — homepage (kickstartingforgood.org) — programme description: 'A 15-week incubation programme' and '$200,000 in grants and seed-funding' (accessed Aug 2025)",
      "ProVeg International — press release 'ProVeg seeks creative minds to change the food system with Kickstarting For Good Incubator' (11 March 2025) — confirms applications open and April 30 deadline, travel/accommodation covered, prize tiers and minimum seed funding per graduate",
      "ProVeg Incubator — 'Kickstarting for Good 2024: Meet the graduates' (5 Dec 2024) — documents 2024 cohort length, two in-person Berlin weeks, and lists alumni including Protein Transition Switzerland, Electric Sheep, Farm Adaptation Network, Vegan Business Circle, etc.",
      "Protein Transition Switzerland — 'Über uns' / About page — states they were a 'Finalteilnahme bei Kickstarting For Good, August 2024' (participated in K4G 2024)",
      "Electric Sheep / Code for Compassion press materials — notes Electric Sheep was incubated by Kickstarting for Good in Nov 2024",
      "FAST Forum post 'Kickstarting for Good's Pilot Programme: Fostering Entrepreneurship in Animal Advocacy' (Jan 2024) and EA Forum announcement posts — document pilot/cohort 2023 alumni (e.g., Reporters for Animals International, Open Paws) and programme iterations",
      "Open Philanthropy / Good Ventures grant entry for Reporters for Animals International (Mar 2025) — confirms the organisation's recent funding (supports existence and activity; consistent with being an incubated initiative)"
    ]
  }
}