{
  "PostValue": {
    "post_id": "QNxc9DGcyRAhdyypF",
    "value_ea": 6,
    "value_humanity": 3,
    "explanation": "This post offers practical, moderately important strategic advice for the EA community — encouraging EA-aligned people to work in non‑EA orgs for influence, learning, and fundraising (including earning-to-give and maximizing employer matches). The points are useful for career allocation, outreach, and scaling funding but are not novel or foundational to EA theory; if correct they modestly improve EA impact, but they don’t change core longtermist or policy decisions. For general humanity the impact is limited and indirect."
  },
  "PostAuthorAura": {
    "post_id": "QNxc9DGcyRAhdyypF",
    "author_fame_ea": 1,
    "author_fame_humanity": 1,
    "explanation": "I can find no evidence that a \"Dave Cortright 🔸\" is a known figure in the EA/rationalist community—no high‑visibility posts, talks, or widely cited writings. The handle may be a pseudonym or minor online user. (There is an unrelated academic David Cortright in peace/arms‑control circles, but he is not prominent within EA.)"
  },
  "PostClarity": {
    "post_id": "QNxc9DGcyRAhdyypF",
    "clarity_score": 8,
    "explanation": "Overall clear and easy to follow: the post has a simple, explicit thesis, good section headings (Influence, Cross-pollination, Pragmatism, E2G), concrete examples and actionable asks (max out employer match, resources). Weaknesses are minor: a few typos/wording issues (e.g. \"to biggest scandal\", uncertain employer name like \"Aabot\"), occasional repetition, and some claims (importance of E2G, scale benefits) could be supported with more data or brief counterarguments. With small edits for phrasing and evidence the post would be very strong."
  },
  "PostNovelty": {
    "post_id": "QNxc9DGcyRAhdyypF",
    "novelty_ea": 2,
    "novelty_humanity": 4,
    "explanation": "Most claims here are already familiar to EA readers: encouraging EA-aligned people to work outside EA orgs for influence, cross-pollination, reality checks, and advocating earning-to-give and maximizing employer matches are long-standing, often-discussed EA strategies. For the general public the combination of ‘work inside mainstream institutions to influence them’ and ‘earn to give / use employer match’ is somewhat less ubiquitous but still common advice in movement-building and personal finance, so it’s mildly novel rather than original."
  },
  "PostInferentialSupport": {
    "post_id": "QNxc9DGcyRAhdyypF",
    "reasoning_quality": 6,
    "evidence_quality": 4,
    "overall_support": 5,
    "explanation": "Strengths: The post lays out a clear, plausible multi-part argument (influence/evangelism, cross-pollination, pragmatism, earning-to-give) and notes practical levers (government roles, employer matches). The logic is generally coherent and the points are mutually supportive. Weaknesses: claims are mostly asserted rather than empirically demonstrated — few citations, no data on how much influence non‑EA employees actually produce, no quantitative estimates of E2G impact, and no engagement with counterarguments (e.g., harms from working at harmful orgs, opportunity costs of not working inside EA). To be stronger it would need concrete case studies or causal evidence showing non‑EA employees change policy/sector outcomes, numbers on funds generated via E2G/employer matches, and a risk/benefit comparison of inside vs outside paths."
  },
  "PostExternalValidation": {
    "post_id": "QNxc9DGcyRAhdyypF",
    "emperical_claim_validation_score": 7,
    "validation_notes": "Most of the post’s empirical claims are broadly supported by external evidence: the EA community is a small, relatively insular movement by most measures (so outreach via non‑EA organisations plausibly matters); EA organisations are small compared with the global labour market (so there are many more non‑EA jobs than EA jobs); and the FTX/Bankman‑Fried collapse did reduce enthusiasm and changed the conversation around ‘earning to give’. Corporate donation‑matching programs do exist and can double employee donations, and several large tech/finance firms offer unusually large caps (e.g. Microsoft’s $15k cap; Google commonly lists $10k). However, some of the specific company numbers in the post are inaccurate or vary by program/region and over time (e.g. Amazon’s match is not uniformly a $10k/year match and Cisco/Intel caps differ across sources). Overall: high‑level claims are well supported; some company‑level details need correction or up‑to‑date verification before being repeated as exact facts.",
    "sources": [
      "Rethink Priorities / EA Survey analysis (estimates of engaged EA community size) — referenced in 80,000 Hours (2021).",
      "80,000 Hours — 'Is effective altruism growing? An update on the stock of funding vs people' (2021).",
      "Bureau of Labor Statistics (BLS) — Employment Situation (showing ~161 million employed persons, 2024 releases).",
      "Congressional Budget Office (CBO) — Monthly Budget Review / Budget and Economic Outlook (US federal outlays ~$6.5–6.8 trillion in 2024), showing scale of government resources.",
      "Axios — 'The hit to effective altruism' (reporting the impact of the FTX collapse on EA funding and reputation, 2022).",
      "EA Forum — 'What might FTX mean for effective giving and EA funding' (community discussion about FTX and E2G).",
      "Double the Donation — 'Corporate Giving and Matching Gift Statistics' (summary of common match caps and prevalence, 2025 update).",
      "Microsoft official blog / Microsoft Employee Giving Program (announcing $15,000 match cap; historically documented).",
      "Google matching gifts program documentation / guides (Google commonly matches up to $10,000/year per employee via Benevity in many summaries).",
      "Cisco corporate blog / FY24 Purpose Report (states Cisco Matching Gifts Program up to $25,000 per employee in FY24).",
      "GiveWell / Wired coverage of GiveWell and EA donations (GiveWell distributions and scale of EA-involved funding)."
    ]
  },
  "PostRobustness": {
    "post_id": "QNxc9DGcyRAhdyypF",
    "robustness_score": 3,
    "actionable_feedback": "1) Address the biggest counterarguments around Earning-to-Give (E2G) and working inside non-EA institutions. The post treats E2G and “evangelising” from non-EA jobs as mostly unambiguously good, but many readers will worry about reputational risk (FTX-style fallout), capture, perverse incentives, and moral hazards. Before publishing, add a short paragraph acknowledging these concerns and giving concrete safeguards or tradeoffs (e.g., when E2G is appropriate, how to avoid conflicts of interest, transparency norms, and how to reduce reputational contagion).\\n\\n2) Add evidence / quantify the scale and impact claims. Lines like “it literally doubles your impact” and implying employer match programs are a major source of EA funding need simple numbers or citations (typical match sizes, how much money this could realistically redirect to high-impact causes compared to donations from EA orgs). Even a few back-of-envelope estimates or links to donor data will make the argument much stronger and less hand-wavy.\\n\\n3) Fix operational oversights in your concrete recommendation (matching donors to match-eligible employees). That suggestion raises privacy, tax, and legal concerns and could be gamed or create compliance headaches. Either remove that bit, or add a short note on practical constraints and a safe implementation path (e.g., use intermediaries/charity-advised funds, anonymized coordination, check tax/tax-deduction rules, and avoid asking employees to route others’ money through employer benefits).",
    "improvement_potential": "The feedback points out major, legitimate omissions that hurt the post's credibility: it flags reputational and moral-hazard risks around E2G and evangelising from non-EA roles, demands simple quantification for strong claims (e.g., employer-match impact), and highlights real legal/privacy/tax pitfalls in the proposed donor-matching idea. Addressing these three items would correct embarrassing operational and argumentative 'own goals' without requiring a long rewrite, and would substantially strengthen the post's persuasiveness."
  }
}