{
  "PostValue": {
    "post_id": "rougRzrPLyDL74B4G",
    "value_ea": 4,
    "value_humanity": 2,
    "explanation": "This is primarily a recruitment announcement for a Partnership Manager at LEEP. For the EA/rationalist community it has modest importance: LEEP is a credible, cost‑effective organisation in an EA-relevant cause (lead exposure), so hiring could materially improve programme capacity and influence where some EA-aligned talent chooses to work — but the post is not a foundational claim or high‑stakes argument. For general humanity the post is low importance: useful mainly to potential applicants and indirectly helpful if the hire accelerates lead‑paint regulation, but a single job posting has minimal direct impact on global outcomes."
  },
  "PostRobustness": {
    "post_id": "rougRzrPLyDL74B4G",
    "robustness_score": 3,
    "actionable_feedback": "1) Salary, location and visa clarity is insufficient and will deter strong applicants. The post gives a narrow salary band only for \"Africa-based roles\" ($50k–$53,333) and otherwise says pay is \"dependent upon location and experience\". It also requires London-based staff to be in-office 3 days/week but gives no London salary or total-compensation details, and says you \"are currently unable to sponsor visas, but may be able to in the future\" without any timeline. Actionable fix: publish clear salary bands for each hiring geography (e.g., London/UK, Africa, other regions you’ll consider), indicate currency, list major benefits and total-comp (pension, leave, parental leave, health insurance if any), and explicitly state visa sponsorship policy (e.g., \"no sponsorship for now; will reconsider after [date]/\"only candidates with right to work in country X\"). This increases application quality and reduces wasted time for candidates and the team.  \n\n2) Role scope, expectations and reporting structure are too vague. The responsibilities list is broad (stakeholder engagement, program implementation, subgrantee management, event coordination) but there’s no sense of priority, expected time allocation, direct manager, performance metrics, or how much autonomy the hire will have. The time-travel requirement (\"8–12 weeks/yr\") and time-zone window (\"between UTC and UTC +3\") are stated but not contextualised (how flexible, how travel is distributed across the year). Actionable fix: add a short section with: (a) % time split across key areas (e.g., 40% stakeholder engagement, 30% program management, 20% events/admin, 10% monitoring), (b) direct line manager/title and team size, (c) 2–3 measurable success criteria for the first 6–12 months, and (d) clearer travel expectations (e.g., typical trip length, whether nights/weekends are expected). This helps candidates self-select and prepares interviewers and applicants for realistic screening.  \n\n3) Application process and timeline are under-specified. You link to an application form but don’t say when candidates will hear back, how many interview stages there are, or what the work task/assessment looks like. For time-sensitive/remote international roles this is critical. Actionable fix: add an \"Application timeline\" short bullet list (application deadline, expected time to first-round decisions, number of interview rounds, whether there will be a paid or unpaid task and approximately how long it takes, and an estimated start window). This reduces follow-up queries and improves candidate experience.",
    "improvement_potential": "The feedback correctly flags three high-impact omissions that will deter strong applicants and waste time (unclear pay/visa/location, vague scope/metrics/reporting, and an underspecified hiring timeline). The suggested fixes are practical and actionable and would materially improve candidate quality and experience. It isn’t a 10 because the post is broadly solid already (not fundamentally wrong), and some suggested additions lengthen the listing, but they’re justified and important for recruiting success."
  },
  "PostAuthorAura": {
    "post_id": "rougRzrPLyDL74B4G",
    "author_fame_ea": 1,
    "author_fame_humanity": 1,
    "explanation": "I find no record in my training data of Tatiana K. Nesic Skuratova as a known contributor within the EA/rationalist community or as a public figure. The name appears to be obscure (or possibly a pseudonym); no prominent publications, talks, or citations are evident. If you can provide links or context (works, affiliations), I can reassess."
  },
  "PostClarity": {
    "post_id": "rougRzrPLyDL74B4G",
    "clarity_score": 8,
    "explanation": "The post is well-structured and easy to follow: it opens with a TLDR, includes clear headings (About LEEP, About the Role, Responsibilities, How to Apply), and provides concrete logistical details (deadline, salary range, location/timezone, language, application link). Responsibilities and candidate requirements are specific and actionable. Weaknesses: it's a bit long and repetitive in places (multiple repeated links and some overlapping phrasing), and a few lines are slightly awkward (e.g., \"Outside of this, dependent upon location and experience\" and minor ambiguity around the timezone phrasing). Overall it strikes a good balance of detail and clarity for a job posting."
  },
  "PostNovelty": {
    "post_id": "rougRzrPLyDL74B4G",
    "novelty_ea": 2,
    "novelty_humanity": 3,
    "explanation": "This is primarily a routine job posting for a Partnership Manager at an existing EA-aligned charity. The format, responsibilities, and hiring details are standard and EA readers are likely already familiar with LEEP and similar programmatic roles. The only moderately uncommon elements are the specific impact/cost-effectiveness figures and program scale (lead‑paint programs in many countries), which might be new to a broader public but are not conceptually novel."
  },
  "PostInferentialSupport": {
    "post_id": "rougRzrPLyDL74B4G",
    "reasoning_quality": 7,
    "evidence_quality": 6,
    "overall_support": 6,
    "explanation": "Strengths: The post presents a coherent, plausible case for LEEP’s impact and need for a Partnership Manager, with concrete activity claims (programs, studies, regulatory wins), links to documentation, and external validation (partnerships with WHO/UNEP, media coverage, and grants from reputable funders). The argument structure is clear and appropriate for a job post: describe mission, accomplishments, and role needs. Weaknesses: Many quantitative claims rely on internal reports or are phrased vaguely (e.g., “reports in 10 countries,” “initiated programs in 31 countries”) with limited methodological detail or independent evaluation. Cost‑effectiveness claims cite Founders Pledge and LEEP analyses but lack transparent assumptions and peer‑reviewed corroboration. Overall, the assertions are reasonably well supported for recruitment/PR purposes, but empirical evidence is not exhaustive or fully independently verifiable."
  },
  "PostExternalValidation": {
    "post_id": "rougRzrPLyDL74B4G",
    "emperical_claim_validation_score": 8,
    "validation_notes": "Most of the post’s major empirical claims are well-supported by primary sources. LEEP’s own publications and independent coverage corroborate: LEEP’s founding date, program counts (31 programs / 18 studies as reported in its 2024 review), the Malawi follow‑up results (big reduction in lead paint market share), spices studies in Türkiye and Ethiopia, the Founders Pledge $1.66 per‑child estimate, the organisation’s multi‑country CEA (~$4.49 per DALY for the first 13 programs), Open Philanthropy and USAID funding, membership in the Partnership for a Lead‑Free Future, and appearances in Nature, Vox, Prospect and the 80,000 Hours podcast. Key claims come from LEEP’s own reports (which are appropriate primary sources) and are independently corroborated by major funder pages and reputable press. Weaknesses: some items are self‑reported (e.g., exact counts like “initiated programs in 31 countries” and “manufacturers >50% market share reformulating in 10 countries” are reported by LEEP in its reviews and so rely on their internal data/market‑share estimates); the claim “appeared in The New Yorker” is plausible given broad press coverage but I could not find a clear New Yorker story that names LEEP directly (other outlets are clearly documented). Also team size/time‑sensitive numbers can change quickly and are self‑reported in job posts. Overall: evidence validates most major empirical claims, with a few small items that are either self‑reported or not independently documented in the public record.",
    "sources": [
      "LEEP — Homepage and About (leadelimination.org).",
      "LEEP — 2024 in Review (leadelimination.org/2024-in-review).",
      "LEEP — Malawi follow-up study results (leadelimination.org/malawi-follow-up-study/).",
      "LEEP — Testing spices for lead content in Türkiye and Ethiopia (leadelimination.org/spices-studies-turkiye-ethiopia/).",
      "LEEP — How cost-effective are LEEP’s paint programs? (leadelimination.org/how-cost-effective-are-leeps-paint-programs/).",
      "Founders Pledge — Lead Exposure Elimination Project profile (founderspledge.com/research/lead-exposure-elimination-project-leep).",
      "Open Philanthropy — Lead Exposure Elimination Project — General Support (openphilanthropy.org/grants/lead-exposure-elimination-project-general-support/).",
      "White House / USAID fact sheet (Oct 24, 2024) referencing USAID support to LEEP (whitehouse.gov briefing).",
      "Partnership for a Lead‑Free Future — Partners list (leadfreefuture.org/about/partners-0).",
      "Nature — 'Saving tens of millions of children a year from the effects of lead poisoning is a surprisingly solvable problem' (Nature, 25 Jul 2023).",
      "Vox — 'Nearly half the world’s kids are exposed to dangerous levels of lead' (Vox, Dylan Matthews, Jan 14, 2022) and Vox coverage of the Partnership (Oct 2024).",
      "80,000 Hours — Podcast: Lucia Coulter on preventing lead poisoning for $1.66 per child (80,000hours.org podcast episode).",
      "Prospect — 'The project to save children from poisonous lead paint' (Prospect magazine, May 2023).",
      "WHO / UNICEF reporting on the global lead burden (UNICEF press release July 2020; WHO lead poisoning fact sheet)."
    ]
  }
}