{
  "PostValue": {
    "post_id": "TKjFRKua5eBveLXCa",
    "value_ea": 6,
    "value_humanity": 2,
    "explanation": "This is practical, actionable career-advice that meaningfully lowers friction for EAs considering policy careers: concrete info on funding, selectivity, application tactics (including LLM use and managing EA affiliation) could shift individual decisions and modestly increase EA-situated talent in policy. It is useful but not foundational — its truth or falsity mainly affects individual career choices rather than core EA/longtermist theory. For general humanity the impact is small and indirect, limited to the career outcomes of a subset of people."
  },
  "PostAuthorAura": {
    "post_id": "TKjFRKua5eBveLXCa",
    "author_fame_ea": 1,
    "author_fame_humanity": 1,
    "explanation": "I could not find any notable presence of 'Sam Anschell' in my training data up to mid‑2024: no prominent posts on EA forums/ LessWrong, no widely cited EA writing, no major talks or organizational roles. If this is a pseudonym or very new author, please provide links or context and I can reassess."
  },
  "PostClarity": {
    "post_id": "TKjFRKua5eBveLXCa",
    "clarity_score": 8,
    "explanation": "Overall very clear and well structured: helpful headings, bullets, and concrete examples make the post easy to follow. The argument is balanced and persuasive — it clearly lays out pros and cons and gives actionable application tips — though some claims are anecdotal or program-specific and could be labeled more explicitly. The post is information-dense and mostly concise for its purpose, but long footnotes, many embedded links, and repeated numeric examples make parts slightly verbose and could be tightened for greater readability."
  },
  "PostNovelty": {
    "post_id": "TKjFRKua5eBveLXCa",
    "novelty_ea": 3,
    "novelty_humanity": 4,
    "explanation": "For an EA Forum audience the post is mostly familiar: many readers already know policy school is a viable public‑policy pathway, that some programs are generously funded, and there are existing Horizon/Forum guides. The main new bits are practical, experience-based specifics (exact stipend examples, comparative admission anecdotes, concrete LLM rules the author confirmed, the recommender‑prompt trick, and named low‑cost consultants). Those are useful but not theoretically novel. For the general public the combination of ‘fully funded policy masters exist and are relatively accessible’, plus the concrete application hacks and LLM guidance, is less widely appreciated, so it’s somewhat more novel but still moderate rather than highly original."
  },
  "PostInferentialSupport": {
    "post_id": "TKjFRKua5eBveLXCa",
    "reasoning_quality": 6,
    "evidence_quality": 4,
    "overall_support": 5,
    "explanation": "Strengths: The post is well-structured, balanced (lists pros and cons), and the arguments are generally logical and practical for an applicant (e.g., funding examples, application time, tailoring recommender input, LLM guidance). The author is careful about limits (notes they haven't attended and flags sources). Weaknesses: The evidence is largely anecdotal (conversations with deans/students, friends, and personal experience) and some claims rely on weak sources (Reddit, unspecified interviews) or unverified inference. There is little systematic or representative data (e.g., broad acceptance rates, funding prevalence, long-term career ROI), so generalizability is limited. Overall, the thesis — that policy school can be a very good deal for many applicants — is plausibly supported as practical advice, but not rigorously demonstrated for a wide population."
  },
  "PostExternalValidation": {
    "post_id": "TKjFRKua5eBveLXCa",
    "emperical_claim_validation_score": 6,
    "validation_notes": "Overall the post’s major empirical claims are broadly plausible and many are supported by authoritative sources, but a handful of specific factual statements are inaccurate or overstated. Verified claims: (1) Princeton SPIA and Yale Jackson both guarantee full tuition/health plan for their M.P.P./M.P.A. students and provide living support for many students; (2) Princeton’s MPA cohort is ~70 students and Yale Jackson’s MPP cohort is ~35 students; (3) Harvard Kennedy School MPP class-size data (243) and HKS is relatively large; (4) Princeton and Yale have summer internship/subsidy programs and experiential learning opportunities exist at top policy schools; (5) graduate-school employment rules differ across schools (Princeton limits external employment to ~10 hours/week without approval; Yale/F-1 students limited to ~19 hours on-campus during term). Examples of problematic/inaccurate claims: (A) the post states Princeton gives a $35k/year stipend and $850/week summer pay — Princeton’s official fellowship/stipend rates are substantially higher in recent years (roughly $50k+ 12-month fellowship figures shown on university pages) and SPIA’s published summer internship subsidy guidance lists $700–$800/week (not $850); (B) the post asserts Princeton and Yale cost “$0 to apply to” — Princeton’s SPIA application fee is listed as $75 (Princeton Graduate School), while Yale Jackson does waive the M.P.P. fee for early submissions but does charge a fee for later submissions (so ‘$0’ is only conditionally true for Yale); (C) acceptance-rate claims (\"top policy schools 15–50%\") are broad and mix up class-size and application-volume inferences (class sizes differ but application counts/acceptance rates are often unpublished and variable). Because most generalized claims are well-supported but several specific numerical claims are contradicted or overstated by official sources, I rate validation as 6/10 (mostly supportable but with notable factual errors).",
    "sources": [
      "Princeton SPIA Financial Aid / MPA & MPP program pages (Princeton School of Public and International Affairs). ([spia.princeton.edu](https://spia.princeton.edu/graduate-admissions/master-public-policy/financial-aid?utm_source=openai))",
      "Princeton Graduate School stipend & award rates (University Fellowship / 2024–25 and 2025–26 rate pages). ([gsadminportal.princeton.edu](https://gsadminportal.princeton.edu/financial-resources/rate-sheets/university-award-rates?utm_source=openai), [gradschool.princeton.edu](https://gradschool.princeton.edu/financial-support/financial-support-model/funding-calendar-university-rates-costs?utm_source=openai))",
      "Princeton SPIA internship FAQ (summer internship subsidy $700–$800/week) and SPIA blog post 'We fully fund all students'. ([spia.princeton.edu](https://spia.princeton.edu/undergraduate-program/faqs?utm_source=openai))",
      "Princeton Graduate School employment & internship policy (limits on additional employment; ~10 hours/week guidance). ([gsadminportal.princeton.edu](https://gsadminportal.princeton.edu/handbooks/dgs-handbook-2024-2025-section-3-academics/external-opportunities-and-work-authorization?utm_source=openai), [gradschool.princeton.edu](https://gradschool.princeton.edu/financial-support/graduate-student-employment/external-opportunities?utm_source=openai))",
      "Yale Jackson M.P.P. Tuition & Funding (guarantees tuition fellowships, many students receive stipends; cost-of-attendance figures). ([jackson.yale.edu](https://jackson.yale.edu/admissions/mpp/tuition-funding/?utm_source=openai))",
      "Yale Jackson class-size / M.P.P. cohort information (about 34–35 students per cohort; class profile). ([jackson.yale.edu](https://jackson.yale.edu/admissions/mpp/?utm_source=openai))",
      "Yale OISS on F-1 on-campus employment (up to 19 hours/week per Yale policy for F-1 students while in session). ([oiss.yale.edu](https://oiss.yale.edu/employment-taxes/employment-for-international-students/f-1-students/f-1-on-campus-employment?utm_source=openai))",
      "Harvard Kennedy School Master’s Program page (class-size statistics: MPP class size ~243). ([hks.harvard.edu](https://www.hks.harvard.edu/admissions-aid/masters-program-admissions?utm_source=openai))",
      "HKS experiential learning / field lab descriptions (example of experiential learning opportunities at HKS). ([hks.harvard.edu](https://www.hks.harvard.edu/centers/taubman/programs-research/rappaport/student-opportunities/experiential-learning?utm_source=openai))",
      "Examples of self-reported student stipend comparisons (anecdotal Reddit thread where applicants report SPIA offering ~$35k and Jackson ~$26k) — useful to explain why some applicants report different numbers, but not authoritative. ([reddit.com](https://www.reddit.com/r/PublicPolicy/comments/1bgiyti?utm_source=openai))"
    ]
  }
}