{
  "PostValue": {
    "post_id": "TNanxkxfDef2ngnLr",
    "value_ea": 3,
    "value_humanity": 2,
    "explanation": "This is a personal, anecdotal pledge rather than an evidence-based argument or new idea. For the EA community it is mildly interesting: it signals extreme commitment, could inspire discussion about norms, obligations, and the costs of longtermist/altruistic lifestyles, and might matter a little for recruiting or culture. It is not load-bearing for EA theory or policy and has limited practical implications. For general humanity it is largely trivial — a touching personal intention but not something that meaningfully changes outcomes or broad decisions (aside from modest inspirational value or the potential harm of promoting unhealthy self-sacrifice)."
  },
  "PostRobustness": {
    "post_id": "TNanxkxfDef2ngnLr",
    "robustness_score": 3,
    "actionable_feedback": "1) Missing practical and sustainability considerations (big personal-risk/credibility hole). You treat “donate everything” as a pure virtue without discussing foreseeable harms: burnout, mental-health decline, social isolation, illness, family responsibilities, and dynamic inconsistency (you might change your mind). Before publishing, either acknowledge these tradeoffs or ask explicitly for advice about them. Actionable fix: add a short paragraph that (a) defines what you mean by “everything” (all income? all assets? after-tax?), (b) asks for experiences or frameworks for sustainable extreme earning-to-give (e.g. limits people set to avoid burnout), and (c) invites resources on mental-health and long-term planning for high-donation lifestyles.\\n\\n2) Overlooks legal/financial and impact-planning details that readers will expect. There are straightforward practicalities (taxes, donation vehicles, estate issues, charity selection and marginal impact, donor-advised funds/trusts) that make “donate everything” nontrivial and could make donations less effective if ignored. Actionable fix: either say you’ve researched these areas or add specific questions (e.g., “how do people structure large give-away plans to minimize tax inefficiency?” “what fraction of income do extreme earners realistically donate?”). Point readers to concrete next steps you’ll take (simulate finances, read Giving What We Can/80,000 Hours, look into DAFs and legal counsel).\\n\\n3) Weak post purpose and call-to-action — hard ask, unlikely to generate useful replies. You ask if anyone will “donate everything” but give no definition, timeline, or reasoned invitation for help. Actionable fix: tighten the ask to get usable replies: e.g., “I’m 14, planning to pursue X career and aim to give Y% of income; does anyone have first-hand experience doing extreme earning-to-give or living minimally while working high hours? What resources/pledges helped you?” Also offer safe ways for people to share private experiences (anonymized anecdotes, links to public posts) and invite mentorship or suggested reading. These edits will make responses more practical and reduce people replying only to criticize naivety.",
    "improvement_potential": "Addresses major omissions the author made (undefined terms, sustainability/burnout risks, legal/financial mechanics, and a weak ask). The suggestions are actionable and would materially improve the post’s clarity and usefulness without requiring a long rewrite. It could be slightly more empathetic to the author’s age/intent, but overall it catches the key mistakes that would undermine productive responses."
  },
  "PostAuthorAura": {
    "post_id": "TNanxkxfDef2ngnLr",
    "author_fame_ea": 1,
    "author_fame_humanity": 1,
    "explanation": "Cannot identify a notable figure from the single-letter name 'S'. Insufficient information to tie this to any known EA/rationalist author or public intellectual. Provide a full name, pen name context, or sample works/links for a meaningful assessment."
  },
  "PostClarity": {
    "post_id": "TNanxkxfDef2ngnLr",
    "clarity_score": 8,
    "explanation": "The post is easy to understand and the writer's intent is clear — a 14-year-old plans to live extremely frugally and give away essentially all future earnings and is asking whether others have done or plan to do the same. Strengths: straightforward phrasing, clear request, and consistent theme. Weaknesses: some repetition (e.g., restating anonymity and anticipated unhappiness), and key terms are vague (what exactly 'donating everything' means, timeline, or tradeoffs), so it could be more concise and precise."
  },
  "PostNovelty": {
    "post_id": "TNanxkxfDef2ngnLr",
    "novelty_ea": 3,
    "novelty_humanity": 5,
    "explanation": "For EA readers the core idea—earn-to-give and extreme frugality to maximize charity—is well known (many have discussed 100% pledges, austere lifestyles, and earn-to-give careers), so this post is not very novel though the personal details (camper van, 14-hour days, donating literally everything) are a somewhat extreme instantiation. For the general public it is more unusual: lifelong total donation is uncommon and evokes ascetic or saintly examples, but the basic concept of giving nearly all income away and living extremely simply is not a radically original idea."
  },
  "PostInferentialSupport": {
    "post_id": "TNanxkxfDef2ngnLr",
    "reasoning_quality": 3,
    "evidence_quality": 1,
    "overall_support": 2,
    "explanation": "The post is honest and shows some awareness of trade-offs (anticipated unhappiness, social costs), but it presents no structured argument for why donating everything is feasible, morally required, or the best strategy compared to more moderate options. Empirical support is essentially absent — just an anecdotal internet search and personal intention — with no data, case studies, legal/tax considerations, or references to relevant literature. Overall the claim is plausible as a personal plan but is very weakly supported if treated as a general recommendation or thesis."
  },
  "PostExternalValidation": {
    "post_id": "TNanxkxfDef2ngnLr",
    "emperical_claim_validation_score": 3,
    "validation_notes": "Most of the post is personal intention (not independently verifiable). However the key empirical claim — “I have not found a single person who has ever donated everything” — is false. Multiple well-documented individuals have given away essentially all or the vast majority of their wealth (e.g., Chuck Feeney donated roughly his entire fortune via Atlantic Philanthropies; Zell Kravinsky gave away ~$45M; Sir Henry Wellcome vested his company to a trust that became the Wellcome Trust). Many wealthy people also pledge to give away most of their wealth (Giving Pledge). Thus the author’s negative claim is contradicted by reliable sources; rating 3 because personal plans are non‑verifiable but the central empirical claim is significantly inaccurate.",
    "sources": [
      "BBC: 'Chuck Feeney: Entrepreneur and philanthropist dies' (10 Oct 2023).",
      "The Atlantic Philanthropies: 'Chuck Feeney…devoted his fortune' (press remembrance, Oct 2023).",
      "New Yorker: 'The Gift' (Ian Parker, Aug 2, 2004) — profile of Zell Kravinsky who gave away ~$45M and donated a kidney.",
      "Wellcome Trust: 'History of Wellcome' — Sir Henry Wellcome vested his company to create the Wellcome Trust (established 1936).",
      "The Giving Pledge: About page — movement of wealthy people committing to give the majority of their wealth."
    ]
  }
}