{
  "PostAuthorAura": {
    "post_id": "Xah6e6CRMwgpjc2eH",
    "author_fame_ea": 1,
    "author_fame_humanity": 1,
    "explanation": "No clear or widely recognized person/pen-name 'Probably Good' in EA or rationalist communities or in broader public discourse based on available information. Likely a pseudonymous/low-profile online handle; please provide links or more context if you want a re-evaluation."
  },
  "PostValue": {
    "post_id": "Xah6e6CRMwgpjc2eH",
    "value_ea": 6,
    "value_humanity": 3,
    "explanation": "Useful, practical resource for channeling early-career talent into high‑impact EA cause areas; could meaningfully affect some people's career trajectories and hence marginally increase effective labor supply to important domains. Not foundational or widely load‑bearing — if the list is wrong or missing items the broader consequences are limited — and it primarily affects individuals rather than broad societal outcomes."
  },
  "PostRobustness": {
    "post_id": "Xah6e6CRMwgpjc2eH",
    "robustness_score": 3,
    "actionable_feedback": "1) No transparent selection criteria or evidence of impact — The post repeatedly calls these internships “promising” and “impactful” but gives no methodology or metrics for those claims. Action: add a brief explanation of how programs were chosen (e.g., scope searched, inclusion/exclusion rules, what “promising” means: past alumni outcomes, org track records, scale, leverage, or alignment with high-impact cause areas). If you don’t have quantitative evidence, label the list as curated/subjective and note known limitations.\n\n2) Missing accessibility and feasibility information — The list likely varies hugely in pay, location, remote options, visa support, and competitiveness, which materially affects who can take the internships. Action: add (or tag) key attributes for each listing: paid/unpaid, stipend amount or range, remote/onsite, country/region, visa support or eligibility, typical applicant background/skills, and application deadlines. If adding fields for every entry is too long, add a short guidance paragraph saying how to assess feasibility and a link to a downloadable CSV for power users.\n\n3) No recency/maintenance and potential conflicts of interest — Readers need to know how up to date the list is and whether you or contributors have relationships with listed programs. Action: add a “last updated” date on the page, state how often you’ll review entries (and how to report changes), and include a short conflicts-of-interest disclosure (e.g., whether the team has worked for or received funding from any listed organizations). This reduces credibility losses if listings are stale or biased.",
    "improvement_potential": "The feedback pinpoints three substantial, actionable weaknesses that meaningfully reduce the list’s usefulness and credibility: unsupported claims of “impactful,” missing accessibility/feasibility metadata (pay, remote/visa, competitiveness), and lack of update/COI information. Fixing these would markedly improve trust and utility and are implementable without bloating the post (short methodology note, per-list tags or a CSV download, and a last-updated/COI line). These are critical improvements — the post isn’t hopeless, but it would be noticeably weaker and potentially misleading without them."
  },
  "PostClarity": {
    "post_id": "Xah6e6CRMwgpjc2eH",
    "clarity_score": 8,
    "explanation": "The post is clear, direct, and well structured: it states the purpose, summarizes what’s included, links to the full list and a practical guide, and ends with a call to action. Language is simple and easy to follow. It could be slightly stronger by briefly describing selection criteria or highlighting a few example internships to make the offering more concrete; there is also minor repetition of links."
  },
  "PostNovelty": {
    "post_id": "Xah6e6CRMwgpjc2eH",
    "novelty_ea": 2,
    "novelty_humanity": 3,
    "explanation": "This is mainly a practical curated resource and application guide rather than a new idea or claim. Among EA Forum readers, similar curated lists and guides to high-impact internships/fellowships are common, so it’s not very novel. To the general public it’s slightly more useful than generic internship lists because of the focus on cause areas and recurring high-impact programs, but the underlying concept (curated opportunity lists + application tips) is still familiar and not highly original."
  },
  "PostInferentialSupport": {
    "post_id": "Xah6e6CRMwgpjc2eH",
    "reasoning_quality": 4,
    "evidence_quality": 2,
    "overall_support": 3,
    "explanation": "Strengths: The post offers a useful, plausible resource (recurring internships across relevant cause areas) and practical advice for applicants; the basic argument—that these roles can be good options for people seeking impactful early-career positions—is reasonable. Weaknesses: The post gives no transparent selection criteria, no empirical outcomes or impact metrics, and no systematic comparison to alternatives. Claims that the listed roles are \"most promising\" or particularly impactful are asserted rather than demonstrated, leaving potential selection bias and relevance gaps unaddressed."
  },
  "PostExternalValidation": {
    "post_id": "Xah6e6CRMwgpjc2eH",
    "emperical_claim_validation_score": 9,
    "validation_notes": "The core empirical claims are well supported: the Probably Good internship page and the accompanying guide exist and state that the listed opportunities are recurring, span multiple cause areas (global health, biosecurity, climate, AI safety, animal welfare, etc.), and include primarily nonprofits plus government, multilateral, and some for‑profit programs. Sampling multiple entries on their list shows many established, recurring programs (WHO, World Bank, UNFCCC, ECDC, Breakthrough Energy Fellows, Mercy For Animals, Last Energy, Charity Entrepreneurship, Rockefeller Foundation). The one caveat is that the claim “likely to be great options” is subjective and not empirically verifiable; likewise, “most are at nonprofits” is consistent with the list but wasn’t quantified (the page itself phrases this as “a large share”). Overall the factual/content claims in the post are accurate and verifiable from primary sources. ",
    "sources": [
      "Probably Good — Top internships for positive impact (internships list). https://probablygood.org/resources/internships/ (page content listing programs)",
      "Probably Good — How to find and land a great internship (guide). https://probablygood.org/how-to-get-a-job/internship/ (practical guide)",
      "WHO — WHO Internship Programme (WHO careers). https://www.who.int/careers/internship-programme (confirms recurring internships, durations, eligibility)",
      "World Bank — Bank Internship Program and related internships. https://www.worldbank.org/en/about/careers/programs-and-internships/internship (recurring summer/seasonal internships)",
      "UNFCCC — Internships page. https://unfccc.int/about-us/internships (recurring UN internships)",
      "ECDC — ECDC Fellowship Programme (EPIET/EUPHEM) call for applications and manual. https://www.ecdc.europa.eu/en/about-ecdc/work-ecdc/call-application-ecdc-fellowship-programme-epiet-and-euphem-paths-eu (recurring fellowship)",
      "Breakthrough Energy — Breakthrough Energy Fellows program. https://www.breakthroughenergy.org/our-work/fellows/ and program application pages (confirms Fellows program and cohort cycles)",
      "Mercy For Animals — Internship program and FAQ. https://mercyforanimals.org/about/careers/ and https://mercyforanimals.org/internship-faq/ (example nonprofit internships listed on Probably Good)",
      "Last Energy — Fellowship program (example of mission-driven for-profit fellowship). https://www.lastenergy.com/careers/fellowships",
      "Charity Entrepreneurship — Incubation Program dates and descriptions. https://www.charityentrepreneurship.com/post/applications-now-open-for-aim-s-2025-programs (confirms recurring incubation runs)",
      "Rockefeller Foundation — Summer Associate / Internship program. https://www.rockefellerfoundation.org/about-us/careers/internships/ (example foundation internship)"
    ]
  }
}