{
  "PostValue": {
    "post_id": "XdeZgsRCnvvrhTCHv",
    "value_ea": 7,
    "value_humanity": 4,
    "explanation": "For the EA/rationalist community this is fairly important: the Toner‑Rodgers paper made a high‑impact empirical claim about AI massively increasing innovation, which directly feeds into forecasting, policy, prioritization, and risk assessments. An influential paper being unreliable or retracted materially changes evidence available for big decisions, so flagging it is load‑bearing and useful. For general humanity the post is less critical: it concerns academic integrity and a single empirical claim. That matters for public discourse and policy only indirectly and less urgently than for specialized forecasting communities, so the overall importance is moderate‑low."
  },
  "PostRobustness": {
    "post_id": "XdeZgsRCnvvrhTCHv",
    "robustness_score": 3,
    "actionable_feedback": "1) Give readers the substantive reasons to distrust the paper, not just signals. Right now the post leans on MIT asking for a retraction and an anecdote about a domain name. If the core problem is data fabrication, coding errors, impossible statistics, conflicts of interest, or failed replications, summarize those specific defects and link to the concrete evidence (e.g. the MIT statement, replication attempts, the bsdetector piece, any Github/code review or reviewer reports). Action: add a 2–4 sentence summary of the actual methodological/data problems and one or two links to primary sources so readers can judge the technical claim quickly.  \n\n2) Remove or de-emphasize circumstantial/sensational signals unless you explain their direct relevance. The domain-name/WIPO anecdote reads as suggestive but is easily dismissed as guilt-by-association and can undermine your credibility. Either explain why that behaviour bears on the paper’s integrity (e.g., ownership/control of data/code, conflict of interest) with evidence, or drop it and stick to verifiable research flaws. Action: rephrase the anecdote to a cautious, evidence-linked note or omit it.  \n\n3) Tell readers what to do next and adopt a measured tone. Right now you say “I wouldn't trust this paper” without guidance. Recommend concrete next steps (e.g., don’t cite it as evidence for AI → innovation claims until investigation concludes; treat its results as unverified; follow X thread or MIT updates). Also soften absolutist wording to reflect uncertainty pending investigation. Action: add one sentence about interim guidance and a promise to update when more information is available.",
    "improvement_potential": "Solid, actionable feedback that targets the post’s main weaknesses: it calls out reliance on circumstantial signals over concrete methodological criticism, warns against sensational anecdotes that undermine credibility, and asks for clear reader guidance. Implementing these changes would materially improve the post’s usefulness and trustworthiness with only a small increase in length. It’s not a 10 because the suggested fixes are straightforward rather than revealing a fatal logical error, but they are high-impact and likely to prevent reader embarrassment."
  },
  "PostAuthorAura": {
    "post_id": "XdeZgsRCnvvrhTCHv",
    "author_fame_ea": 1,
    "author_fame_humanity": 1,
    "explanation": "Insufficient identifying information—'Eva' (single name/pseudonym) does not match any widely known EA/rationalist author or a globally recognized public figure. Please provide a last name, pseudonym context, notable works, or links to assess prominence more accurately."
  },
  "PostClarity": {
    "post_id": "XdeZgsRCnvvrhTCHv",
    "clarity_score": 7,
    "explanation": "The post is concise, direct, and easy to follow: it states the claim of the paper, notes MIT's retraction request, flags suspicious signals, and links to sources. However it is light on specifics (what exactly is wrong with the paper, who the \"student\" is, and why the domain/WIPO matter are important), uses vague language like \"dodgy signals,\" and relies on external links rather than summarizing evidence, so the argument is not fully compelling or self-contained."
  },
  "PostNovelty": {
    "post_id": "XdeZgsRCnvvrhTCHv",
    "novelty_ea": 2,
    "novelty_humanity": 3,
    "explanation": "The post is largely a timely report/flag about a specific paper being questioned and a retraction request—not a new conceptual idea. EA readers regularly see critiques of high-profile AI claims and research-integrity warnings, so it’s not novel for that audience (score 2). For the general public the specific case/details may be new, but the overall claim (don’t trust a paper with apparent misconduct/weaknesses; retractions happen) is commonplace (score 3). The only mildly novel element is the specific anecdotal signals (domain registration/WIPO complaint), which are case-specific rather than conceptually original."
  },
  "PostInferentialSupport": {
    "post_id": "XdeZgsRCnvvrhTCHv",
    "reasoning_quality": 6,
    "evidence_quality": 4,
    "overall_support": 5,
    "explanation": "Strengths: The post makes a cautious, proportionate claim (expressing distrust of the paper rather than asserting definitive fraud) and points to a strong, relevant institutional signal (MIT asking for retraction) plus additional corroborating links. Weaknesses: The argument is brief and largely circumstantial — it does not summarize the substantive methodological or data problems that motivated the retraction request, and it leans on secondary signals (a domain registration/tweet and a Substack write-up) rather than presenting direct, assessed evidence of errors or misconduct. That makes the reasoning plausible but shallow, and the empirical evidence relevant but incomplete, so the conclusion is moderately but not rigorously supported."
  },
  "PostExternalValidation": {
    "post_id": "XdeZgsRCnvvrhTCHv",
    "emperical_claim_validation_score": 9,
    "validation_notes": "The post’s factual claims are well-supported. The arXiv preprint (arXiv:2412.17866) indeed claimed large AI-driven increases in discoveries/patents; MIT publicly stated on May 16, 2025 that it has “no confidence” in the paper and asked arXiv / QJE to withdraw it; arXiv shows the paper was administratively withdrawn (v2, May 20, 2025). Independent records show a WIPO domain-dispute (case D2025-0410) for corningresearch.com naming Aidan Toner‑Rodgers as respondent and ordering transfer to Corning, consistent with the post’s “dodgy signals” claim. Independent commentary (e.g., WSJ, multiple technical/blog writeups including Ben Shindel’s “The BS Detector”) documents the red flags and public scrutiny. Minor caveats: MIT’s internal review details remain confidential (MIT did not publish the full investigatory record), so some procedural specifics are not public — but the core empirical claims in the post are verifiable and accurate. ",
    "sources": [
      "arXiv:2412.17866 — \"Artificial Intelligence, Scientific Discovery, and Product Innovation\" (Aidan Toner-Rodgers) — arXiv page (withdrawn by arXiv admin; v2 dated 20 May 2025).",
      "MIT Economics news — \"Assuring an accurate research record\" (MIT statement, May 16, 2025).",
      "WIPO case listing D2025-0410 — domain corningresearch.com; Complainant: Corning Incorporated; Respondent: Aidan Toner-Rodgers; Decision: Transfer (case summary / WIPO listings).",
      "Wall Street Journal — \"MIT Says It No Longer Stands Behind Student's AI Research Paper\" (news coverage reporting MIT statement and subsequent actions, May 16, 2025).",
      "Ben Shindel — The BS Detector (Substack) — \"AI, Materials, and Fraud, Oh My!\" (detailed public writeup of red flags; widely cited by reporting and commentators, May 2025).",
      "Secondary reporting and analysis (examples): More Is Different blog post \"That MIT paper... is fake..\"; Research Signals \"Research Fraud at MIT: High-Profile Study Was Too Good to Be True\" (both summarizing the same facts and linking to MIT/WIPO/coverage)."
    ]
  }
}