{
  "PostValue": {
    "post_id": "yxjxbTkFjFamuDfW4",
    "value_ea": 3,
    "value_humanity": 2,
    "explanation": "The post appears to be a short summary/promotion of Giving What We Can’s view on global catastrophic risks and recommended organizations. For the EA/rationalist community it is mildly useful — it can influence donor attention and funding choices but doesn’t offer novel, load‑bearing analysis or arguments that would shift major strategies. For general humanity it’s of low importance: it targets donors and practitioners rather than presenting new evidence or policy proposals that would materially change outcomes at a planetary scale."
  },
  "PostRobustness": {
    "post_id": "yxjxbTkFjFamuDfW4",
    "robustness_score": 2,
    "actionable_feedback": "1) Add concrete substance — the post currently reads like a headline. EA readers will expect specifics: name 3–6 organisations you recommend, give one-sentence summaries of what each does, and include at least one quantitative or qualitative reason you think each is high-impact (e.g. cost-effectiveness estimates, counterfactual impact, or key program evidence). Without specifics the post feels uninformative and unpublishable.\n\n2) Explain your selection criteria and key assumptions — state the decision framework (e.g. expected value, neglectedness, tractability), the major assumptions (probabilities, time horizons, moral weightings such as longtermism vs neartermism), and any exclusions. This prevents readers from inferring unstated or controversial priors and lets them judge whether your framing applies to them.\n\n3) Replace the vague CTA with actionable, verifiable next steps and sources — link to the Giving What We Can evaluation or selection methodology, provide direct donation links or a short ‘how to get started’ checklist, and cite any reports or external evaluations you relied on. Also add a short note on uncertainty and tradeoffs (e.g. why these risks vs other causes) so readers can see you’ve considered reasonable counterarguments.",
    "improvement_potential": "Very useful — the feedback targets the post's core failures (it's only a headline with no specifics, no selection criteria, and a vague CTA). For an EA audience those are major omissions: readers will expect named organisations, concise evidence or cost‑effectiveness claims, and the decision framework/assumptions behind recommendations. Implementing the suggestions would substantially raise the post from uninformative to publishable. Minor caveat: following the advice will lengthen the post, but that can be managed with short summaries and links to sources."
  },
  "PostAuthorAura": {
    "post_id": "yxjxbTkFjFamuDfW4",
    "author_fame_ea": 4,
    "author_fame_humanity": 1,
    "explanation": "\"EA Handbook\" appears to be a collective/resource title or pseudonymous/organizational author (a guide for newcomers) rather than a single prominent individual. It is reasonably known within EA/rationalist circles as a reference but not a well‑known author or frequent public figure; it has virtually no recognition outside the EA community."
  },
  "PostClarity": {
    "post_id": "yxjxbTkFjFamuDfW4",
    "clarity_score": 8,
    "explanation": "The post is easy to understand, uses simple language, and states its purpose and call to action succinctly. It could be stronger by including brief specifics (examples of risks or organizations, selection criteria, or a clearer link) — as written it is clear but somewhat generic and minimal."
  },
  "PostNovelty": {
    "post_id": "yxjxbTkFjFamuDfW4",
    "novelty_ea": 1,
    "novelty_humanity": 3,
    "explanation": "The post is a very generic promotional blurb: it states that global catastrophic risks exist and that Giving What We Can highlights high-impact organisations. For EA Forum readers this adds almost nothing new (EA and longtermist communities routinely produce such profiles and guidance), so novelty is near zero. For the general educated public it's slightly more novel but still commonplace — public charities, media and NGOs frequently promote GCR-focused giving and donor guides, and the post offers no new arguments, data, or frameworks."
  },
  "PostInferentialSupport": {
    "post_id": "yxjxbTkFjFamuDfW4",
    "reasoning_quality": 3,
    "evidence_quality": 1,
    "overall_support": 2,
    "explanation": "The post makes a plausible but very high‑level claim (that global catastrophic risks are important and that Giving What We Can highlights high‑impact organizations addressing them). The reasoning is minimal: it states the problem and asserts a solution without defining key terms (e.g. what counts as 'high‑impact'), explaining how organizations were selected, or laying out causal pathways from donations to reduced risk. Empirical support is essentially absent — no organizations, metrics, cost‑effectiveness analyses, past impact, or external evaluations are cited. Strengths: correctly identifies widely discussed categories of catastrophic risk and aligns with mainstream EA concerns. Weaknesses: lack of detail, transparency, and evidence means the claim is weakly supported. To improve, the post should provide named organizations, selection criteria, quantitative impact or cost‑effectiveness estimates, and references to evaluations or modeling showing how donations reduce risk."
  },
  "PostExternalValidation": {
    "post_id": "yxjxbTkFjFamuDfW4",
    "emperical_claim_validation_score": 8,
    "validation_notes": "The post's core empirical claims are well supported. Giving What We Can explicitly lists “reducing global catastrophic risks” (biosecurity/pandemics, AI safety, nuclear risk) as a recommended cause area and runs funds (Risks & Resilience, Emerging Challenges) that allocate donor money to organisations addressing those threats. Independent, peer‑reviewed and policy literature supports that pandemics, nuclear war, and advanced AI are widely considered global catastrophic/existential risks (e.g., Johns Hopkins on GCBRs; climate/‘nuclear winter’ modelling; expert and institutional assessments of AI risk). Weaknesses: the phrase “unprecedented scale” is qualitative (but consistent with the cited literature) and numerical probability estimates vary and are debated; the post is high‑level and omits specific probability or impact quantification.",
    "sources": [
      "Giving What We Can — 'Reducing global catastrophic risks' cause area page, GivingWhatWeCan.org (accessed Aug 2025).",
      "Giving What We Can — 'Risks and Resilience Fund' page (includes May 2025 update on grant rounds), GivingWhatWeCan.org.",
      "Giving What We Can — 'Emerging Challenges Fund' page (describes grants to biosecurity, AI safety, nuclear policy), GivingWhatWeCan.org.",
      "Johns Hopkins Center for Health Security — 'Global Catastrophic Biological Risks: Toward a Working Definition' (Health Security, 2017).",
      "Robock A., et al., 'Nuclear winter revisited with a modern climate model and current nuclear arsenals: Still catastrophic consequences' (J. Geophys. Res. Atmos., 2007) — modeling showing severe global climatic/agricultural impacts from nuclear war.",
      "Toby Ord, 'The Precipice: Existential Risk and the Future of Humanity' (Bloomsbury, 2020) — synthesis arguing nuclear war, engineered pandemics, and advanced AI are leading anthropogenic existential risks.",
      "World Economic Forum — Global Risks Report / 'Global Risks 2034' analysis (2024) — discusses AI as a major systemic/global risk and its interaction with security/stability."
    ]
  }
}