{
  "PostValue": {
    "post_id": "zF6JwFibbfQBXAgyh",
    "value_ea": 3,
    "value_humanity": 1,
    "explanation": "This is a low-stakes request for alternative prioritization/resource lists to inform an individual's career planning. It could be moderately useful to a subset of the EA/rationalist community (helping people broaden sources when doing career/problem prioritization), but it doesn't present new arguments or claims that would shift major views or policy. For general humanity it is essentially trivial."
  },
  "PostRobustness": {
    "post_id": "zF6JwFibbfQBXAgyh",
    "robustness_score": 3,
    "actionable_feedback": "1) Missing key decision context (values, time horizon, and prioritization criteria). Right now it’s impossible for others to recommend alternative lists because different lists target different questions (short‑term vs longtermist risks, philanthropic effectiveness vs policy priorities, global burden vs existential risk). Action: add a one‑sentence statement of your values and time horizon and whether you care most about scale/neglectedness/tractability/robustness to uncertainty. That will let responders point to the right kind of lists.\n\n2) Assumes all “problem prioritization lists” are comparable and equally useful. In practice these lists vary widely in scope, methodology, and assumptions (EA orgs vs academic/global institutions vs UN/WEF reports). Action: ask explicitly whether you want EA‑aligned lists only or also mainstream/academic ones, and say whether you prefer lists that include reasoning/methodology or just rankings. This will avoid bad recommendations.\n\n3) No evidence of prior search or desired format, which lowers signal and duplicates effort. Action: briefly list 1–2 places you’ve already checked (e.g., only 80k), and say whether you want a short curated list, links, or a synthesis/comparison. Also include preferred channels (EA Forum replies, DMs, Google Drive). That will make replies faster and more targeted.",
    "improvement_potential": "The feedback identifies the key omissions that materially weaken the post: lack of values/time-horizon/criteria, an implicit assumption that different prioritization lists are comparable, and no sign of prior searching or desired reply format. These are high-impact, actionable fixes that would make replies far more targeted and useful, and they can be implemented with only a sentence or two, so the cost in post length is low. (Not a 9–10 because the post isn’t fatally flawed — it just needs this contextual information.)"
  },
  "PostAuthorAura": {
    "post_id": "zF6JwFibbfQBXAgyh",
    "author_fame_ea": 1,
    "author_fame_humanity": 1,
    "explanation": "I have no evidence that a person or pseudonym 'lamparita' is a known figure in the EA/rationalist community or publicly: no prominent publications, talks, or citations are associated with that name in my knowledge. If you can provide links or context (forum, posts, articles), I can reassess."
  },
  "PostClarity": {
    "post_id": "zF6JwFibbfQBXAgyh",
    "clarity_score": 8,
    "explanation": "The post is easy to understand, concise, and well-structured: it gives context (80k template), quotes the relevant options, states the plan (mix approaches), and asks a clear question (where to find alternative prioritization lists). It could be made slightly clearer by specifying what kinds of lists are most useful (e.g., EA-aligned, academic, policy-focused) or giving an example of what the asker considers a good alternative, but overall it communicates the request succinctly and effectively."
  },
  "PostNovelty": {
    "post_id": "zF6JwFibbfQBXAgyh",
    "novelty_ea": 2,
    "novelty_humanity": 3,
    "explanation": "This is mainly a straightforward resource request (asking for alternative problem-prioritization lists beyond 80,000 Hours) rather than presenting new ideas or claims. EA readers will find it very familiar and unsurprising—many people in the community have asked for or compiled alternative lists—so it's not novel for that audience. For the general public it's slightly more novel only insofar as the specific context (80k's career template and formal prioritization lists) may be unfamiliar, but the underlying impulse—seeking other expert lists or opinions—is commonplace."
  },
  "PostInferentialSupport": {
    "post_id": "zF6JwFibbfQBXAgyh",
    "reasoning_quality": 4,
    "evidence_quality": 1,
    "overall_support": 3,
    "explanation": "The post is clear and logically coherent as a request — it reasonably motivates wanting alternative prioritization lists and correctly references 80k’s guidance. However it does not present an argument or criteria for evaluating alternative lists, and offers no empirical evidence or examples of other lists. Strengths: clarity, sensible motivation. Weaknesses: absence of supporting evidence, no evaluative framework, and no alternatives provided."
  },
  "PostExternalValidation": {
    "post_id": "zF6JwFibbfQBXAgyh",
    "emperical_claim_validation_score": 9,
    "validation_notes": "The post’s factual claims are minimal and mostly accurate: 80,000 Hours does present the two broad approaches and links the career-planning template to its problem list and a ‘how to compare problems’ guide — those pages and wording are verifiable. There are also many alternative problem-prioritization resources (Open Philanthropy cause reports, WEF Global Risks rankings, UN SDGs, Global Priorities Institute research, GiveWell’s charity-focused prioritization), so the author’s request for other lists is reasonable. Minor limitation: the author’s personal statement that they do not know other lists is subjective and not independently verifiable. Overall, core empirical claims check out and alternatives exist, so I deduct only a small amount for the unverifiable personal-knowledge statement.",
    "sources": [
      "80,000 Hours — What are the most pressing world problems? (Problem profiles) — Last updated June 18, 2025. (80000hours.org/problem-profiles/)",
      "80,000 Hours — How to compare global problems for yourself (career-planning guidance) — Published September 2021. (80000hours.org/articles/comparing-problems-yourself/)",
      "80,000 Hours — Career plan template / career-planning tool (shows the template and advice referenced). (80000hours.org/career-planning/career-plan-template/)",
      "Open Philanthropy — Cause prioritization / Cause reports and research (examples of an alternative prioritization source; see e.g. blog post on cause-prioritization team, Dec 21, 2023). (openphilanthropy.org)",
      "World Economic Forum — Global Risks Report 2025 (an alternative, expert-survey-based ranking of global risks). (weforum.org/publications/global-risks-report-2025/)",
      "United Nations — The Sustainable Development Goals (UN list of 17 global goals / problems). (un.org/sustainabledevelopment/)",
      "Global Priorities Institute — About / working papers (academic research programme on global priorities and cause-prioritization). (globalprioritiesinstitute.org/about-us/ and working papers page)",
      "GiveWell — Process for identifying top charities; Top Charities page (example of an evidence-driven prioritization focused on global health & development). (givewell.org/what-do-our-ratings-mean and givewell.org/charities/top-charities)"
    ]
  }
}